pikasTech/PikaPython/bsp/w806/Include/wm_regs.h
/**
 * @file    wm_regs.h
 *
 * @brief   register & operation file
 *
 * @author  winnermicro
 *
 * Copyright (c) 2015 Winner Microelectronics Co., Ltd.
 */
#ifndef WM_REGS_H
#define WM_REGS_H

//#include "core_cm3.h"
#include <stdint.h>
#include "core_804.h"


typedef enum IRQn
{
/****** specific Interrupt Numbers *********************************************************/
  SDIO_IRQn                   = 0,      /*!< SDIO Receiver/Transmit/Command Receiver/SDIO Command Transmit Interrupt */
  MAC_IRQn                 	  = 1,      /*!< MAC Interrupt                                        */
  RF_CFG_IRQn                 = 2,      /*!< RF_CFG Interrupt                                        */
  SEC_IRQn                    = 3,      /*!< SEC RX/TX_MNGT/TX_DATA Interrupt                     */
  DMA_Channel0_IRQn           = 4,      /*!< DMA  Channel 0 global Interrupt                      */
  DMA_Channel1_IRQn           = 5,      /*!< DMA  Channel 1 global Interrupt                      */
  DMA_Channel2_IRQn           = 6,      /*!< DMA  Channel 2 global Interrupt                      */
  DMA_Channel3_IRQn           = 7,      /*!< DMA  Channel 3 global Interrupt                      */
  DMA_Channel4_7_IRQn         = 8,      /*!< DMA  Channel 4~7 global Interrupt                    */
  DMA_BRUST_IRQn              = 9,      /*!< DMA Burst global Interrupt                           */
  I2C_IRQn         			  = 10,     /*!< I2C Interrupts                                       */
  ADC_IRQn        			  = 11,     /*!< ADC Convert Interrupts                               */
  SPI_LS_IRQn                 = 12,     /*!< Low Speed SPI Interrupt                              */
  SPI_HS_IRQn                 = 13,     /*!< High Speed SPI Interrupt                             */
  GPIOA_IRQn                  = 14,     /*!< GPIO A Interrupt                                     */
  GPIOB_IRQn                  = 15,     /*!< GPIO B Interrupt                                     */
  UART0_IRQn                  = 16,     /*!< UART0 Interrupts                                     */
  UART1_IRQn               	  = 17,     /*!< UART1 Interrupt                                      */
  TOUCH_IRQn				  = 18,		/*!< TOUCH SENSOR                                      */
  UART2_5_IRQn                = 19,     /*!< UART2/3/4/5 Interrupt                                */
  BLE_IRQn                    = 20,     /*!< BLE Interrupt                                        */
  BT_IRQn                     = 21,     /*!< BT Interrupt                                         */
  PWM_IRQn                 	  = 22,     /*!< PWM Interrupt                                        */
  I2S_IRQn              	  = 23,     /*!< I2S  Interrupts                                      */
  SIDO_HOST_IRQn              = 24,     /*!< SDIO Host Interrupts                                 */
  SYS_TICK_IRQn               = 25,     /*!< SYS Tick Interrupts                                  */
  RSA_IRQn                    = 26,     /*!< RSA Interrupts                                       */
  CRYPTION_IRQn               = 27,     /*!< GPSEC Interrupts                                     */
  FLASH_IRQn                  = 28,     /*!< Flash Interrupt                                      */
  PMU_IRQn                    = 29,     /*!< PMU Interrupt                                        */
  TIM_IRQn                    = 30,     /*!< Timer0~5 Trigger                                     */
  WDG_IRQn                	  = 31,     /*!< Watch Dog Interrupt                                  */
} IRQn_Type;

#define APB_CLK      (40000000) /* 40MHz */

#define DEVICE_BASE_ADDR    0x40000000
/* APB BaseAddr*/
#define HR_APB_BASE_ADDR 	0x40010000UL


/***************************************************************
 * DMA Reg
 ***************************************************************/
 
#define DMA_BASE	(DEVICE_BASE_ADDR + 0x0800)
#define DMA_Channel0_BASE	(DMA_BASE + 0x0010)
#define DMA_Channel1_BASE	(DMA_BASE + 0x0040)
#define DMA_Channel2_BASE	(DMA_BASE + 0x0070)
#define DMA_Channel3_BASE	(DMA_BASE + 0x00A0)
#define DMA_Channel4_BASE	(DMA_BASE + 0x00D0)
#define DMA_Channel5_BASE	(DMA_BASE + 0x0100)
#define DMA_Channel6_BASE	(DMA_BASE + 0x0130)
#define DMA_Channel7_BASE	(DMA_BASE + 0x0460)

typedef struct
{
	__IOM uint32_t IM;
	__IOM uint32_t IF;
	__IOM uint32_t REQCH;
	__IOM uint32_t RSV;
} DMA_TypeDef;

typedef struct
{
	__IOM uint32_t SA;
	__IOM uint32_t DA;
	__IOM uint32_t SWA;
	__IOM uint32_t DWA;
	__IOM uint32_t WLEN;
	__IOM uint32_t CR1;
	__IOM uint32_t MODE;
	__IOM uint32_t CR2;
	__IM uint32_t SR;
	__IOM uint32_t LA;
	__IM uint32_t CDA;
} DMA_Channel_TypeDef;

#define DMA_IM_TRANSFER_DONE_Pos			(1)
#define DMA_IM_TRANSFER_DONE_Msk			(0x1UL << DMA_IM_TRANSFER_DONE_Pos)
#define DMA_IM_TRANSFER_DONW				DMA_IM_TRANSFER_DONE_Msk
#define DMA_IM_BURST_DONE_Pos				(0)
#define DMA_IM_BURST_DONE_Msk				(0x1UL << DMA_IM_BURST_DONE_Pos)
#define DMA_IM_BURST_DONE					DMA_IM_BURST_DONE_Msk

#define DMA_IF_TRANSFER_DONE_Pos			(1)
#define DMA_IF_TRANSFER_DONE_Msk			(0x1UL << DMA_IF_TRANSFER_DONE_Pos)
#define DMA_IF_TRANSFER_DONE				(DMA_IF_TRANSFER_DONE_Msk)
#define DMA_IF_BURST_DONE_Pos				(0)
#define DMA_IF_BURST_DONE_Msk				(0x1UL << DMA_IF_BURST_DONE_Pos)
#define DMA_IF_BURST_DONE					DMA_IF_BURST_DONE_Msk

#define DMA_REQCH_UART_Pos					(0)
#define DMA_REQCH_UART_Msk					(0x7UL << DMA_REQCH_UART_Pos)
#define DMA_REQCH_UART						DMA_REQCH_UART_Msk
#define DMA_REQCH_UART0						(0x0UL << DMA_REQCH_UART_Pos)
#define DMA_REQCH_UART1						(0x1UL << DMA_REQCH_UART_Pos)
#define DMA_REQCH_UART2						(0x2UL << DMA_REQCH_UART_Pos)
#define DMA_REQCH_UART3						(0x3UL << DMA_REQCH_UART_Pos)
#define DMA_REQCH_UART4						(0x4UL << DMA_REQCH_UART_Pos)
#define DMA_REQCH_UART5						(0x5UL << DMA_REQCH_UART_Pos)

#define DMA_WLEN_D_Pos						(16)
#define DMA_WLEN_D_Msk						(0xFFFFUL << DMA_WLEN_D_Pos)
#define DMA_WLEN_D							DMA_WLEN_D_Msk
#define DMA_WLEN_S_Pos						(0)
#define DMA_WLEN_S_Msk						(0xFFFFUL << DMA_WLEN_S_Pos)
#define DMA_WLEN_S							DMA_WLEN_S_Msk

#define DMA_CR1_STOP_Pos					(1)
#define DMA_CR1_STOP_Msk					(0x1UL << DMA_CR1_STOP_Pos)
#define DMA_CR1_STOP						DMA_CR1_STOP_Msk
#define DMA_CR1_START_Pos					(0)
#define DMA_CR1_START_Msk					(0x1UL << DMA_CR1_START_Pos)
#define DMA_CR1_START						DMA_CR1_START_Msk

