pikasTech/PikaPython/bsp/w806/Include/wm_regs.h
#define DMA_MODE_LINK_Pos					(6)
#define DMA_MODE_LINK_Msk					(0x1UL << DMA_MODE_LINK_Pos)
#define DMA_MODE_LINK						DMA_MODE_LINK_Msk
#define DMA_MODE_CH_Pos						(2)
#define DMA_MODE_CH_Msk						(0xFUL << DMA_MODE_CH_Pos)
#define DMA_MODE_CH							DMA_MODE_CH_Msk
#define DMA_MODE_CH_UART_RX					(0x0UL << DMA_MODE_CH_Pos)
#define DMA_MODE_CH_UART_TX					(0x1UL << DMA_MODE_CH_Pos)
#define DMA_MODE_CH_PWM_CAP0				(0x2UL << DMA_MODE_CH_Pos)
#define DMA_MODE_CH_PWM_CAP1				(0x3UL << DMA_MODE_CH_Pos)
#define DMA_MODE_CH_LSPI_RX					(0x4UL << DMA_MODE_CH_Pos)
#define DMA_MODE_CH_LSPI_TX					(0x5UL << DMA_MODE_CH_Pos)
#define DMA_MODE_CH_ADC0					(0x6UL << DMA_MODE_CH_Pos)
#define DMA_MODE_CH_ADC1					(0x7UL << DMA_MODE_CH_Pos)
#define DMA_MODE_CH_ADC2					(0x8UL << DMA_MODE_CH_Pos)
#define DMA_MODE_CH_ADC3					(0x9UL << DMA_MODE_CH_Pos)
#define DMA_MODE_CH_I2SRX					(0xAUL << DMA_MODE_CH_Pos)
#define DMA_MODE_CH_I2STX					(0xBUL << DMA_MODE_CH_Pos)
#define DMA_MODE_CH_SDIO					(0xCUL << DMA_MODE_CH_Pos)
#define DMA_MODE_LNM_Pos					(1)
#define DMA_MODE_LNM_Msk					(0x1UL << DMA_MODE_LNM_Pos)
#define DMA_MODE_LNM						DMA_MODE_LNM_Msk
#define DMA_MODE_SHM_Pos					(0)
#define DMA_MODE_SHM_Msk					(0x1UL << DMA_MODE_SHM_Pos)
#define DMA_MODE_SHM						DMA_MODE_SHM_Msk

#define DMA_CR2_LEN_Pos						(8)
#define DMA_CR2_LEN_Msk						(0xFFFFUL << DMA_CR2_LEN_Pos)
#define DMA_CR2_LEN							DMA_CR2_LEN_Msk
#define DMA_CR2_BURST_SIZE_Pos				(7)
#define DMA_CR2_BURST_SIZE_Msk				(0x1UL << DMA_CR2_BURST_SIZE_Pos)
#define DMA_CR2_BURST_SIZE					DMA_CR2_BURST_SIZE_Msk
#define DMA_CR2_TRANS_SIZE_Pos				(5)
#define DMA_CR2_TRANS_SIZE_Msk				(0x3UL << DMA_CR2_TRANS_SIZE_Pos)
#define DMA_CR2_TRANS_SIZE					DMA_CR2_TRANS_SIZE_Msk
#define DMA_CR2_TRANS_SIZE_BYTE				(0x0UL << DMA_CR2_TRANS_SIZE_Pos)
#define DMA_CR2_TRANS_SIZE_HALFWORD			(0x1UL << DMA_CR2_TRANS_SIZE_Pos)
#define DMA_CR2_TRANS_SIZE_WORD				(0x2UL << DMA_CR2_TRANS_SIZE_Pos)
#define DMA_CR2_DINC_Pos					(3)
#define DMA_CR2_DINC_Msk					(0x3UL << DMA_CR2_DINC_Pos)
#define DMA_CR2_DINC						DMA_CR2_DINC_Msk
#define DMA_CR2_DINC_DISABLE				(0x0UL << DMA_CR2_DINC_Pos)
#define DMA_CR2_DINC_ENABLE					(0x1UL << DMA_CR2_DINC_Pos)
#define DMA_CR2_DINC_CYCLE					(0x3UL << DMA_CR2_DINC_Pos)
#define DMA_CR2_SINC_Pos					(1)
#define DMA_CR2_SINC_Msk					(0x3UL << DMA_CR2_SINC_Pos)
#define DMA_CR2_SINC						DMA_CR2_SINC_Msk
#define DMA_CR2_SINC_DISABLE				(0x0UL << DMA_CR2_SINC_Pos)
#define DMA_CR2_SINC_ENABLE					(0x1UL << DMA_CR2_SINC_Pos)
#define DMA_CR2_SINC_CYCLE					(0x3UL << DMA_CR2_SINC_Pos)
#define DMA_CR2_AUTORELOAD_Pos				(0)
#define DMA_CR2_AUTORELOAD_Msk				(0x1UL << DMA_CR2_AUTORELOAD_Pos)
#define DMA_CR2_AUTORELOAD					DMA_CR2_AUTORELOAD_Msk


/***************************************************************
 * PMU Reg
 ***************************************************************/

#define PMU_BASE	(DEVICE_BASE_ADDR + 0x0D00)

typedef struct
{
	__IOM uint32_t CR;
	__IOM uint32_t TIMER0;
	__IOM uint32_t RSV;
	__IOM uint32_t RTCCR0;
	__IOM uint32_t RTCCR1;
	__IOM uint32_t IF;
} PMU_TypeDef;

#define PMU_CR_WAKEUP_LEVEL_Pos				(10)
#define PMU_CR_WAKEUP_LEVEL_Msk				(0x01 << PMU_CR_WAKEUP_LEVEL_Pos)
#define PMU_CR_WAKEUP_LEVEL					PMU_CR_WAKEUP_LEVEL_Msk
#define PMU_CR_WAKEUP_COUNT_Pos				(6)
#define PMU_CR_WAKEUP_COUNT_Msk				(0x0F << PMU_CR_WAKEUP_COUNT_Pos)
#define PMU_CR_WAKEUP_COUNT					PMU_CR_WAKEUP_COUNT_Msk
#define PMU_CR_32KRCBYPASS_Pos				(4)
#define	PMU_CR_32KRCBYPASS_Msk				(0x01 << PMU_CR_32KRCBYPASS_Pos)
#define PMU_CR_32KRCBYPASS					PMU_CR_32KRCBYPASS_Msk
#define PMU_CR_32KRC_CAL_EN_Pos				(3)
#define PMU_CR_32KRC_CAL_EN_Msk				(0x01 << PMU_CR_32KRC_CAL_EN_Pos)
#define PMU_CR_32KRC_CAL_EN					PMU_CR_32KRC_CAL_EN_Msk
#define PMU_CR_SLEEP_EN_Pos					(1)
#define PMU_CR_SLEEP_EN_Msk					(0x01 << PMU_CR_SLEEP_EN_Pos)
#define PMU_CR_SLEEP_EN						PMU_CR_SLEEP_EN_Msk
#define PMU_CR_STANDBY_EN_Pos				(0)
#define PMU_CR_STANDBY_EN_Msk				(0x01 << PMU_CR_STANDBY_EN_Pos)
#define PMU_CR_STANDBY_EN					PMU_CR_STANDBY_EN_Msk

#define PMU_TIMER0_EN_Pos					(16)
#define PMU_TIMER0_EN_Msk					(0x01 << PMU_TIMER0_EN_Pos)
#define PMU_TIMER0_EN						PMU_TIMER0_EN_Msk
#define PMU_TIMER0_VALUE_Pos				(0)
#define PMU_TIMER0_VALUE_Msk				(0x0FFFF << PMU_TIMER0_VALUE_Pos)
#define PMU_TIMER0_VALUE					PMU_TIMER0_VALUE_Msk

#define PMU_RTCCR0_TIMING_EN_Pos			(31)
#define PMU_RTCCR0_TIMING_EN_Msk			(0x01 << PMU_RTCCR0_TIMING_EN_Pos)
#define PMU_RTCCR0_TIMING_EN				PMU_RTCCR0_TIMING_EN_Msk
#define PMU_RTCCR0_DATE_Pos					(24)
#define PMU_RTCCR0_DATE_Msk					(0x01F << PMU_RTCCR0_DATE_Pos)
#define PMU_RTCCR0_DATE						PMU_RTCCR0_DATE_Msk
#define PMU_RTCCR0_HOUR_Pos					(16)
#define PMU_RTCCR0_HOUR_Msk					(0x01F << PMU_RTCCR0_HOUR_Pos)
#define PMU_RTCCR0_HOUR						PMU_RTCCR0_HOUR_Msk
#define PMU_RTCCR0_MINUTE_Pos				(8)
#define PMU_RTCCR0_MINUTE_Msk				(0x03F << PMU_RTCCR0_MINUTE_Pos)
#define PMU_RTCCR0_MINUTE					PMU_RTCCR0_MINUTE_Msk
#define PMU_RTCCR0_SECOND_Pos				(0)
#define PMU_RTCCR0_SECOND_Msk				(0x03F << PMU_RTCCR0_SECOND_Pos)
#define PMU_RTCCR0_SECOND					PMU_RTCCR0_SECOND_Msk

#define PMU_RTCCR1_EN_Pos					(16)
#define PMU_RTCCR1_EN_Msk					(0x01 << PMU_RTCCR1_EN_Pos)
#define PMU_RTCCR1_EN						PMU_RTCCR1_EN_Msk
#define PMU_RTCCR1_YEAR_Pos					(8)
#define PMU_RTCCR1_YEAR_Msk					(0x07F << PMU_RTCCR1_YEAR_Pos)
#define PMU_RTCCR1_YEAR						PMU_RTCCR1_YEAR_Msk
#define PMU_RTCCR1_MONTH_Pos				(0)
#define PMU_RTCCR1_MONTH_Msk				(0x0F << PMU_RTCCR1_MONTH_Pos)
#define PMU_RTCCR1_MONTH					PMU_RTCCR1_MONTH_Msk

#define PMU_IF_SLEEP_Pos					(8)
#define PMU_IF_SLEEP_Msk					(0x01 << PMU_IF_SLEEP_Pos)
#define PMU_IF_SLEEP						PMU_IF_SLEEP_Msk
#define PMU_IF_STANDBY_Pos					(7)
#define PMU_IF_STANDBY_Msk					(0x01 << PMU_IF_STANDBY_Pos)
#define PMU_IF_STANDBY						PMU_IF_STANDBY_Msk
#define PMU_IF_RTC_Pos						(4)
#define PMU_IF_RTC_Msk						(0x01 << PMU_IF_RTC_Pos)
#define PMU_IF_RTC							PMU_IF_RTC_Msk
#define PMU_IF_IO_WAKE_Pos					(2)
#define PMU_IF_IO_WAKE_Msk					(0x01 << PMU_IF_IO_WAKE_Pos)
#define PMU_IF_IO_WAKE						PMU_IF_IO_WAKE_Msk
#define PMU_IF_TIM0_Pos						(0)
#define PMU_IF_TIM0_Msk						(0x01 << PMU_IF_TIM0_Pos)
#define PMU_IF_TIM0							PMU_IF_TIM0_Msk


/***************************************************************
 * system clock and bus clock Reg
 ***************************************************************/

#define RCC_BASE	(DEVICE_BASE_ADDR + 0xE00)

typedef struct
{
	__IOM uint32_t CLK_EN;
	__IOM uint32_t CLK_MASK;
	__IOM uint32_t BBP_CLK;
	__IOM uint32_t RST;
	__IOM uint32_t CLK_DIV;
	__IOM uint32_t CLK_SEL;
	__IOM uint32_t I2S_CLK;
	__IOM uint32_t RST_STATUS;
} RCC_TypeDef;

#define RCC_CLK_EN_TOUCH_Pos				(21)
#define RCC_CLK_EN_TOUCH_Msk                (0x1 << RCC_CLK_EN_TOUCH_Pos)
#define RCC_CLK_EN_TOUCH                    RCC_CLK_EN_TOUCH_Msk
#define RCC_CLK_EN_BT_Pos					(20)
#define RCC_CLK_EN_BT_Msk                	(0x1 << RCC_CLK_EN_BT_Pos)
#define RCC_CLK_EN_BT                    	RCC_CLK_EN_BT_Msk
#define RCC_CLK_EN_QSRAM_Pos				(19)
#define RCC_CLK_EN_QSRAM_Msk                (0x1 << RCC_CLK_EN_QSRAM_Pos)
#define RCC_CLK_EN_QSRAM                    RCC_CLK_EN_QSRAM_Msk
#define RCC_CLK_EN_SDIO_Pos					(18)
#define RCC_CLK_EN_SDIO_Msk                	(0x1 << RCC_CLK_EN_SDIO_Pos)
#define RCC_CLK_EN_SDIO                    	RCC_CLK_EN_SDIO_Msk
#define RCC_CLK_EN_GPSEC_Pos				(17)
#define RCC_CLK_EN_GPSEC_Msk                (0x1 << RCC_CLK_EN_GPSEC_Pos)
#define RCC_CLK_EN_GPSEC                    RCC_CLK_EN_GPSEC_Msk
#define RCC_CLK_EN_RSA_Pos					(16)
#define RCC_CLK_EN_RSA_Msk                	(0x1 << RCC_CLK_EN_RSA_Pos)
#define RCC_CLK_EN_RSA                    	RCC_CLK_EN_RSA_Msk
#define RCC_CLK_EN_I2S_Pos					(15)
#define RCC_CLK_EN_I2S_Msk                	(0x1 << RCC_CLK_EN_I2S_Pos)
#define RCC_CLK_EN_I2S                    	RCC_CLK_EN_I2S_Msk
#define RCC_CLK_EN_LCD_Pos					(14)
#define RCC_CLK_EN_LCD_Msk                	(0x1 << RCC_CLK_EN_LCD_Pos)
#define RCC_CLK_EN_LCD                    	RCC_CLK_EN_LCD_Msk
#define RCC_CLK_EN_PWM_Pos					(13)
#define RCC_CLK_EN_PWM_Msk                	(0x1 << RCC_CLK_EN_PWM_Pos)
#define RCC_CLK_EN_PWM                    	RCC_CLK_EN_PWM_Msk
#define RCC_CLK_EN_ADC_Pos					(12)
#define RCC_CLK_EN_ADC_Msk                	(0x1 << RCC_CLK_EN_ADC_Pos)
#define RCC_CLK_EN_ADC                    	RCC_CLK_EN_ADC_Msk
#define RCC_CLK_EN_GPIO_Pos					(11)
#define RCC_CLK_EN_GPIO_Msk                	(0x1 << RCC_CLK_EN_GPIO_Pos)
#define RCC_CLK_EN_GPIO                    	RCC_CLK_EN_GPIO_Msk
#define RCC_CLK_EN_TIMER_Pos				(10)
#define RCC_CLK_EN_TIMER_Msk                (0x1 << RCC_CLK_EN_TIMER_Pos)
#define RCC_CLK_EN_TIMER                    RCC_CLK_EN_TIMER_Msk
#define RCC_CLK_EN_RF_Pos					(9)
#define RCC_CLK_EN_RF_Msk                	(0x1 << RCC_CLK_EN_RF_Pos)
#define RCC_CLK_EN_RF                    	RCC_CLK_EN_RF_Msk
#define RCC_CLK_EN_DMA_Pos					(8)
#define RCC_CLK_EN_DMA_Msk                	(0x1 << RCC_CLK_EN_DMA_Pos)
#define RCC_CLK_EN_DMA                    	RCC_CLK_EN_DMA_Msk
#define RCC_CLK_EN_LSPI_Pos					(7)
#define RCC_CLK_EN_LSPI_Msk                	(0x1 << RCC_CLK_EN_LSPI_Pos)
#define RCC_CLK_EN_LSPI                    	RCC_CLK_EN_LSPI_Msk
#define RCC_CLK_EN_UART5_Pos				(6)
#define RCC_CLK_EN_UART5_Msk                (0x1 << RCC_CLK_EN_UART5_Pos)
#define RCC_CLK_EN_UART5                    RCC_CLK_EN_UART5_Msk
#define RCC_CLK_EN_UART4_Pos				(5)
#define RCC_CLK_EN_UART4_Msk                (0x1 << RCC_CLK_EN_UART4_Pos)
#define RCC_CLK_EN_UART4                    RCC_CLK_EN_UART4_Msk
#define RCC_CLK_EN_UART3_Pos				(4)
#define RCC_CLK_EN_UART3_Msk                (0x1 << RCC_CLK_EN_UART3_Pos)
#define RCC_CLK_EN_UART3                    RCC_CLK_EN_UART3_Msk
#define RCC_CLK_EN_UART2_Pos				(3)
#define RCC_CLK_EN_UART2_Msk                (0x1 << RCC_CLK_EN_UART2_Pos)
#define RCC_CLK_EN_UART2                    RCC_CLK_EN_UART2_Msk
#define RCC_CLK_EN_UART1_Pos				(2)
#define RCC_CLK_EN_UART1_Msk                (0x1 << RCC_CLK_EN_UART1_Pos)
#define RCC_CLK_EN_UART1                    RCC_CLK_EN_UART1_Msk
#define RCC_CLK_EN_UART0_Pos				(1)
#define RCC_CLK_EN_UART0_Msk                (0x1 << RCC_CLK_EN_UART0_Pos)
#define RCC_CLK_EN_UART0                    RCC_CLK_EN_UART0_Msk
#define RCC_CLK_EN_I2C_Pos					(0)
#define RCC_CLK_EN_I2C_Msk                	(0x1 << RCC_CLK_EN_I2C_Pos)
#define RCC_CLK_EN_I2C                    	RCC_CLK_EN_I2C_Msk
#define RCC_CLK_EN_ALL_Pos					(0)
#define RCC_CLK_EN_ALL_Msk                	(0x3FFFFF << RCC_CLK_EN_ALL_Pos)
#define RCC_CLK_EN_ALL                    	RCC_CLK_EN_ALL_Msk

#define RCC_CLK_MASK_CPU_Pos				(6)
#define RCC_CLK_MASK_CPU_Msk                (0x1 << RCC_CLK_MASK_CPU_Pos)
#define RCC_CLK_MASK_CPU                    RCC_CLK_MASK_CPU_Msk
#define RCC_CLK_MASK_TPIK_WEP_Pos			(5)
#define RCC_CLK_MASK_TPIK_WEP_Msk           (0x1 << RCC_CLK_MASK_TPIK_WEP_Pos)
#define RCC_CLK_MASK_TPIK_WEP               RCC_CLK_MASK_TPIK_WEP_Msk
#define RCC_CLK_MASK_CCMP_Pos				(4)
#define RCC_CLK_MASK_CCMP_Msk               (0x1 << RCC_CLK_MASK_CCMP_Pos)
#define RCC_CLK_MASK_CCMP                   RCC_CLK_MASK_CCMP_Msk
#define RCC_CLK_MASK_WPI_Pos				(3)
#define RCC_CLK_MASK_WPI_Msk                (0x1 << RCC_CLK_MASK_WPI_Pos)
#define RCC_CLK_MASK_WPI                    RCC_CLK_MASK_WPI_Msk
#define RCC_CLK_MASK_SDIOAHB_Pos			(1)
#define RCC_CLK_MASK_SDIOAHB_Msk            (0x1 << RCC_CLK_MASK_SDIOAHB_Pos)
#define RCC_CLK_MASK_SDIOAHB                RCC_CLK_MASK_SDIOAHB_Msk
#define RCC_CLK_MASK_PMU_Pos				(0)
#define RCC_CLK_MASK_PMU_Msk            	(0x1 << RCC_CLK_MASK_PMU_Pos)
#define RCC_CLK_MASK_PMU                	RCC_CLK_MASK_PMU_Msk

#define RCC_BBP_CLK_WIFI_Pos				(4)
#define RCC_BBP_CLK_WIFI_Msk            	(0x1 << RCC_BBP_CLK_WIFI_Pos)
#define RCC_BBP_CLK_WIFI                	RCC_BBP_CLK_WIFI_Msk
#define RCC_BBP_CLK_RX_Pos					(2)
#define RCC_BBP_CLK_RX_Msk            		(0x3 << RCC_BBP_CLK_RX_Pos)
#define RCC_BBP_CLK_RX                		RCC_BBP_CLK_RX_Msk
#define RCC_BBP_CLK_RX_00					(0x0 << RCC_BBP_CLK_RX_Pos)
#define RCC_BBP_CLK_RX_01					(0x1 << RCC_BBP_CLK_RX_Pos)
#define RCC_BBP_CLK_RX_10					(0x2 << RCC_BBP_CLK_RX_Pos)
#define RCC_BBP_CLK_RX_11					(0x3 << RCC_BBP_CLK_RX_Pos)
#define RCC_BBP_CLK_TX_Pos					(0)
#define RCC_BBP_CLK_TX_Msk            		(0x3 << RCC_BBP_CLK_TX_Pos)
#define RCC_BBP_CLK_TX                		RCC_BBP_CLK_TX_Msk
#define RCC_BBP_CLK_TX_00					(0x0 << RCC_BBP_CLK_TX_Pos)
#define RCC_BBP_CLK_TX_01					(0x1 << RCC_BBP_CLK_TX_Pos)
#define RCC_BBP_CLK_TX_11					(0x3 << RCC_BBP_CLK_TX_Pos)

