pikasTech/PikaPython/bsp/w806/Include/wm_regs.h
#define RCC_RST_TOUCH_Pos					(31)
#define RCC_RST_TOUCH_Msk            		(0x1 << RCC_RST_TOUCH_Pos)
#define RCC_RST_TOUCH                		RCC_RST_TOUCH_Msk
#define RCC_RST_FLASH_Pos					(30)
#define RCC_RST_FLASH_Msk            		(0x1 << RCC_RST_FLASH_Pos)
#define RCC_RST_FLASH                		RCC_RST_FLASH_Msk
#define RCC_RST_BT_Pos						(29)
#define RCC_RST_BT_Msk            			(0x1 << RCC_RST_BT_Pos)
#define RCC_RST_BT                			RCC_RST_BT_Msk
#define RCC_RST_QSPI_Pos					(28)
#define RCC_RST_QSPI_Msk            		(0x1 << RCC_RST_QSPI_Pos)
#define RCC_RST_QSPI                		RCC_RST_QSPI_Msk
#define RCC_RST_GPSEC_Pos					(26)
#define RCC_RST_GPSEC_Msk            		(0x1 << RCC_RST_GPSEC_Pos)
#define RCC_RST_GPSEC                		RCC_RST_GPSEC_Msk
#define RCC_RST_RSA_Pos						(25)
#define RCC_RST_RSA_Msk            			(0x1 << RCC_RST_RSA_Pos)
#define RCC_RST_RSA                			RCC_RST_RSA_Msk
#define RCC_RST_I2S_Pos						(24)
#define RCC_RST_I2S_Msk            			(0x1 << RCC_RST_I2S_Pos)
#define RCC_RST_I2S                			RCC_RST_I2S_Msk
#define RCC_RST_LCD_Pos						(23)
#define RCC_RST_LCD_Msk            			(0x1 << RCC_RST_LCD_Pos)
#define RCC_RST_LCD                			RCC_RST_LCD_Msk
#define RCC_RST_PWM_Pos						(22)
#define RCC_RST_PWM_Msk            			(0x1 << RCC_RST_PWM_Pos)
#define RCC_RST_PWM                			RCC_RST_PWM_Msk
#define RCC_RST_ADC_Pos						(21)
#define RCC_RST_ADC_Msk            			(0x1 << RCC_RST_ADC_Pos)
#define RCC_RST_ADC                			RCC_RST_ADC_Msk
#define RCC_RST_TIMER_Pos					(20)
#define RCC_RST_TIMER_Msk            		(0x1 << RCC_RST_TIMER_Pos)
#define RCC_RST_TIMER                		RCC_RST_TIMER_Msk
#define RCC_RST_GPIO_Pos					(19)
#define RCC_RST_GPIO_Msk            		(0x1 << RCC_RST_GPIO_Pos)
#define RCC_RST_GPIO                		RCC_RST_GPIO_Msk
#define RCC_RST_RF_Pos						(18)
#define RCC_RST_RF_Msk            			(0x1 << RCC_RST_RF_Pos)
#define RCC_RST_RF                			RCC_RST_RF_Msk
#define RCC_RST_SSPI_Pos					(17)
#define RCC_RST_SSPI_Msk            		(0x1 << RCC_RST_SSPI_Pos)
#define RCC_RST_SSPI                		RCC_RST_SSPI_Msk
#define RCC_RST_MSPI_Pos					(16)
#define RCC_RST_MSPI_Msk            		(0x1 << RCC_RST_MSPI_Pos)
#define RCC_RST_MSPI                		RCC_RST_MSPI_Msk
#define RCC_RST_UART5_Pos					(15)
#define RCC_RST_UART5_Msk            		(0x1 << RCC_RST_UART5_Pos)
#define RCC_RST_UART5                		RCC_RST_UART5_Msk
#define RCC_RST_UART4_Pos					(14)
#define RCC_RST_UART4_Msk            		(0x1 << RCC_RST_UART4_Pos)
#define RCC_RST_UART4                		RCC_RST_UART4_Msk
#define RCC_RST_UART3_Pos					(13)
#define RCC_RST_UART3_Msk            		(0x1 << RCC_RST_UART3_Pos)
#define RCC_RST_UART3                		RCC_RST_UART3_Msk
#define RCC_RST_UART2_Pos					(12)
#define RCC_RST_UART2_Msk            		(0x1 << RCC_RST_UART2_Pos)
#define RCC_RST_UART2                		RCC_RST_UART2_Msk
#define RCC_RST_UART1_Pos					(11)
#define RCC_RST_UART1_Msk            		(0x1 << RCC_RST_UART1_Pos)
#define RCC_RST_UART1                		RCC_RST_UART1_Msk
#define RCC_RST_UART0_Pos					(10)
#define RCC_RST_UART0_Msk            		(0x1 << RCC_RST_UART0_Pos)
#define RCC_RST_UART0                		RCC_RST_UART0_Msk
#define RCC_RST_I2C_Pos						(9)
#define RCC_RST_I2C_Msk            			(0x1 << RCC_RST_I2C_Pos)
#define RCC_RST_I2C                			RCC_RST_I2C_Msk
#define RCC_RST_BUS2_Pos					(8)
#define RCC_RST_BUS2_Msk            		(0x1 << RCC_RST_BUS2_Pos)
#define RCC_RST_BUS2                		RCC_RST_BUS2_Msk
#define RCC_RST_BUS1_Pos					(7)
#define RCC_RST_BUS1_Msk            		(0x1 << RCC_RST_BUS1_Pos)
#define RCC_RST_BUS1                		RCC_RST_BUS1_Msk
#define RCC_RST_APB_Pos						(6)
#define RCC_RST_APB_Msk            			(0x1 << RCC_RST_APB_Pos)
#define RCC_RST_APB                			RCC_RST_APB_Msk
#define RCC_RST_MEM_Pos						(5)
#define RCC_RST_MEM_Msk            			(0x1 << RCC_RST_MEM_Pos)
#define RCC_RST_MEM                			RCC_RST_MEM_Msk
#define RCC_RST_DMA_Pos						(4)
#define RCC_RST_DMA_Msk            			(0x1 << RCC_RST_DMA_Pos)
#define RCC_RST_DMA                			RCC_RST_DMA_Msk
#define RCC_RST_SDIO_Pos					(3)
#define RCC_RST_SDIO_Msk            		(0x1 << RCC_RST_SDIO_Pos)
#define RCC_RST_SDIO                		RCC_RST_SDIO_Msk
#define RCC_RST_SEC_Pos						(2)
#define RCC_RST_SEC_Msk            			(0x1 << RCC_RST_SEC_Pos)
#define RCC_RST_SEC                			RCC_RST_SEC_Msk
#define RCC_RST_MAC_Pos						(1)
#define RCC_RST_MAC_Msk            			(0x1 << RCC_RST_MAC_Pos)
#define RCC_RST_MAC                			RCC_RST_MAC_Msk
#define RCC_RST_BBP_Pos						(0)
#define RCC_RST_BBP_Msk            			(0x1 << RCC_RST_BBP_Pos)
#define RCC_RST_BBP                			RCC_RST_BBP_Msk

#define RCC_CLK_DIV_FREQ_EN_Pos				(31)
#define RCC_CLK_DIV_FREQ_EN_Msk            	(0x1 << RCC_CLK_DIV_FREQ_EN_Pos)
#define RCC_CLK_DIV_FREQ_EN					RCC_CLK_DIV_FREQ_EN_Msk
#define RCC_CLK_DIV_PERIPHERAL_Pos			(24)
#define RCC_CLK_DIV_PERIPHERAL_Msk          (0xF << RCC_CLK_DIV_PERIPHERAL_Pos)
#define RCC_CLK_DIV_PERIPHERAL				RCC_CLK_DIV_PERIPHERAL_Msk
#define RCC_CLK_DIV_BUS2_SYNCDN_FACTOR_Pos	(16)
#define RCC_CLK_DIV_BUS2_SYNCDN_FACTOR_Msk  (0xFF << RCC_CLK_DIV_BUS2_SYNCDN_FACTOR_Pos)
#define RCC_CLK_DIV_BUS2_SYNCDN_FACTOR		RCC_CLK_DIV_BUS2_SYNCDN_FACTOR_Msk
#define RCC_CLK_DIV_WLAN_Pos				(8)
#define RCC_CLK_DIV_WLAN_Msk          		(0xFF << RCC_CLK_DIV_WLAN_Pos)
#define RCC_CLK_DIV_WLAN					RCC_CLK_DIV_WLAN_Msk
#define RCC_CLK_DIV_CPU_Pos					(0)
#define RCC_CLK_DIV_CPU_Msk          		(0xFF << RCC_CLK_DIV_CPU_Pos)
#define RCC_CLK_DIV_CPU						RCC_CLK_DIV_CPU_Msk

#define RCC_CLK_SEL_ADC_Pos					(16)
#define RCC_CLK_SEL_ADC_Msk          		(0x1 << RCC_CLK_SEL_ADC_Pos)
#define RCC_CLK_SEL_ADC						RCC_CLK_SEL_ADC_Msk
#define RCC_CLK_SEL_ADC_DIV_Pos				(8)
#define RCC_CLK_SEL_ADC_DIV_Msk          	(0xFF << RCC_CLK_SEL_ADC_DIV_Pos)
#define RCC_CLK_SEL_ADC_DIV					RCC_CLK_SEL_ADC_DIV_Msk
#define RCC_CLK_SEL_QSPI_RAM_Pos			(7)
#define RCC_CLK_SEL_QSPI_RAM_Msk          	(0x1 << RCC_CLK_SEL_QSPI_RAM_Pos)
#define RCC_CLK_SEL_QSPI_RAM				RCC_CLK_SEL_QSPI_RAM_Msk
#define RCC_CLK_SEL_QFLASH_Pos				(6)
#define RCC_CLK_SEL_QFLASH_Msk          	(0x1 << RCC_CLK_SEL_QFLASH_Pos)
#define RCC_CLK_SEL_QFLASH					RCC_CLK_SEL_QFLASH_Msk
#define RCC_CLK_SEL_GPSEC_Pos				(5)
#define RCC_CLK_SEL_GPSEC_Msk          		(0x1 << RCC_CLK_SEL_GPSEC_Pos)
#define RCC_CLK_SEL_GPSEC					RCC_CLK_SEL_GPSEC_Msk
#define RCC_CLK_SEL_RSA_Pos					(4)
#define RCC_CLK_SEL_RSA_Msk          		(0x1 << RCC_CLK_SEL_RSA_Pos)
#define RCC_CLK_SEL_RSA						RCC_CLK_SEL_RSA_Msk
#define RCC_CLK_SEL_DAC_REV_Pos				(3)
#define RCC_CLK_SEL_DAC_REV_Msk          	(0x1 << RCC_CLK_SEL_DAC_REV_Pos)
#define RCC_CLK_SEL_DAC_REV					RCC_CLK_SEL_DAC_REV_Msk
#define RCC_CLK_SEL_ADC_REV_Pos				(2)
#define RCC_CLK_SEL_ADC_REV_Msk          	(0x1 << RCC_CLK_SEL_ADC_REV_Pos)
#define RCC_CLK_SEL_ADC_REV					RCC_CLK_SEL_ADC_REV_Msk
#define RCC_CLK_SEL_TEST_Pos				(1)
#define RCC_CLK_SEL_TEST_Msk          		(0x1 << RCC_CLK_SEL_TEST_Pos)
#define RCC_CLK_SEL_TEST					RCC_CLK_SEL_TEST_Msk
#define RCC_CLK_SEL_ADC_DAC_LOOP_Pos		(0)
#define RCC_CLK_SEL_ADC_DAC_LOOP_Msk        (0x1 << RCC_CLK_SEL_ADC_DAC_LOOP_Pos)
#define RCC_CLK_SEL_ADC_DAC_LOOP			RCC_CLK_SEL_ADC_DAC_LOOP_Msk

#define RCC_I2S_CLK_BCLKDIV_Pos				(8)
#define RCC_I2S_CLK_BCLKDIV_Msk          	(0x3FF << RCC_I2S_CLK_BCLKDIV_Pos)
#define RCC_I2S_CLK_BCLKDIV					RCC_I2S_CLK_BCLKDIV_Msk
#define RCC_I2S_CLK_MCLKDIV_Pos				(2)
#define RCC_I2S_CLK_MCLKDIV_Msk          	(0x3F << RCC_I2S_CLK_MCLKDIV_Pos)
#define RCC_I2S_CLK_MCLKDIV					RCC_I2S_CLK_MCLKDIV_Msk
#define RCC_I2S_CLK_MCLK_EN_Pos				(1)
#define RCC_I2S_CLK_MCLK_EN_Msk          	(0x1 << RCC_I2S_CLK_MCLK_EN_Pos)
#define RCC_I2S_CLK_MCLK_EN					RCC_I2S_CLK_MCLK_EN_Msk
#define RCC_I2S_CLK_EXTAL_EN_Pos			(0)
#define RCC_I2S_CLK_EXTAL_EN_Msk          	(0x1 << RCC_I2S_CLK_EXTAL_EN_Pos)
#define RCC_I2S_CLK_EXTAL_EN				RCC_I2S_CLK_EXTAL_EN_Msk

#define RCC_RST_STATUS_CPU_CLEAR_Pos		(3)
#define RCC_RST_STATUS_CPU_CLEAR_Msk        (0x1 << RCC_RST_STATUS_CPU_CLEAR_Pos)
#define RCC_RST_STATUS_CPU_CLEAR			RCC_RST_STATUS_CPU_CLEAR_Msk
#define RCC_RST_STATUS_WDG_CLEAR_Pos		(2)
#define RCC_RST_STATUS_WDG_CLEAR_Msk        (0x1 << RCC_RST_STATUS_WDG_CLEAR_Pos)
#define RCC_RST_STATUS_WDG_CLEAR			RCC_RST_STATUS_WDG_CLEAR_Msk
#define RCC_RST_STATUS_CPU_Pos				(1)
#define RCC_RST_STATUS_CPU_Msk        		(0x1 << RCC_RST_STATUS_CPU_Pos)
#define RCC_RST_STATUS_CPU					RCC_RST_STATUS_CPU_Msk
#define RCC_RST_STATUS_WDG_Pos				(0)
#define RCC_RST_STATUS_WDG_Msk        		(0x1 << RCC_RST_STATUS_WDG_Pos)
#define RCC_RST_STATUS_WDG					RCC_RST_STATUS_WDG_Msk


/***************************************************************
 * I2C Reg
 ***************************************************************/
 
#define I2C_BASE	(HR_APB_BASE_ADDR + 0x0000)

typedef struct
{
	__IOM uint32_t PRESCALE_L;
	__IOM uint32_t PRESCALE_H;
	__IOM uint32_t EN;
	__IOM uint32_t DATA;
	__IOM uint32_t CR_SR;
} I2C_TypeDef;

#define I2C_PRESCALE_L_Pos					(0)
#define I2C_PRESCALE_L_Msk					(0xFF << I2C_PRESCALE_L_Pos)
#define I2C_PRESCALE_L						I2C_PRESCALE_L_Msk

