pikasTech/PikaPython/bsp/w806/Include/wm_regs.h
#define I2C_PRESCALE_H_Pos					(0)
#define I2C_PRESCALE_H_Msk					(0xFF << I2C_PRESCALE_H_Pos)
#define I2C_PRESCALE_H						I2C_PRESCALE_H_Msk

#define I2C_EN_ENABLE_Pos					(7)
#define I2C_EN_ENABLE_Msk					(0x01 << I2C_EN_ENABLE_Pos)
#define I2C_EN_ENABLE						I2C_EN_ENABLE_Msk
#define I2C_EN_IEMASK_Pos					(6)
#define I2C_EN_IEMASK_Msk					(0x01 << I2C_EN_IEMASK_Pos)
#define I2C_EN_IEMASK						I2C_EN_IEMASK_Msk

#define I2C_DATA_Pos						(0)
#define I2C_DATA_Msk						(0x0FF << I2C_DATA_Pos)
#define I2C_DATA							I2C_DATA_MskS

#define I2C_CR_START_Pos					(7)
#define I2C_CR_START_Msk					(0x01 << I2C_CR_START_Pos)
#define I2C_CR_START						I2C_CR_START_Msk
#define I2C_CR_STOP_Pos						(6)
#define I2C_CR_STOP_Msk						(0x01 << I2C_CR_STOP_Pos)
#define I2C_CR_STOP							I2C_CR_STOP_Msk
#define I2C_CR_RD_Pos						(5)
#define I2C_CR_RD_Msk						(0x01 << I2C_CR_RD_Pos)
#define I2C_CR_RD							I2C_CR_RD_Msk
#define I2C_CR_WR_Pos						(4)
#define I2C_CR_WR_Msk						(0x01 << I2C_CR_WR_Pos)
#define I2C_CR_WR							I2C_CR_WR_Msk
#define I2C_CR_ACK_Pos						(3)
#define I2C_CR_ACK_Msk						(0x01 << I2C_CR_ACK_Pos)
#define I2C_CR_ACK							I2C_CR_ACK_Msk
#define I2C_CR_IF_Pos						(0)
#define I2C_CR_IF_Msk						(0x01 << I2C_CR_IF_Pos)
#define I2C_CR_IF							I2C_CR_IF_Msk
#define I2C_SR_RXACK_Pos					(7)
#define I2C_SR_RXACK_Msk					(0x01 << I2C_SR_RXACK_Pos)
#define I2C_SR_RXACK						I2C_SR_RXACK_Msk
#define I2C_SR_BUSY_Pos						(6)
#define I2C_SR_BUSY_Msk						(0x01 << I2C_SR_BUSY_Pos)
#define I2C_SR_BUSY							I2C_SR_BUSY_Msk
#define I2C_SR_TIP_Pos						(1)
#define I2C_SR_TIP_Msk						(0x01 << I2C_SR_TIP_Pos)
#define I2C_SR_TIP							I2C_SR_TIP_Msk
#define I2C_SR_IF_Pos						(0)
#define I2C_SR_IF_Msk						(0x01 << I2C_SR_IF_Pos)
#define I2C_SR_IF							I2C_SR_IF_Msk


/***************************************************************
 * SPI Reg
 ***************************************************************/

#define SPI_BASE	(HR_APB_BASE_ADDR + 0x400)

typedef struct
{
	__IOM uint32_t CH_CFG;
	__IOM uint32_t SPI_CFG;
	__IOM uint32_t CLK_CFG;
	__IOM uint32_t MODE_CFG;
	__IOM uint32_t INT_MASK;
	__IOM uint32_t INT_SRC;
	__IM uint32_t STATUS;
	__IOM uint32_t TIMEOUT;
	__IOM uint32_t TXDATA;
	__IOM uint32_t TRANS_MODE;
	__IM uint32_t SLV_LEN;
	__IM uint32_t RSV;
	__IM uint32_t RXDATA;
} SPI_TypeDef;

#define SPI_CH_CFG_RXINVALIDBIT_Pos			(23)
#define SPI_CH_CFG_RXINVALIDBIT_Msk         (0xFF << SPI_CH_CFG_RXINVALIDBIT_Pos)
#define SPI_CH_CFG_RXINVALIDBIT             SPI_CH_CFG_RXINVALIDBIT_Msk
#define SPI_CH_CFG_CLEARFIFOS_Pos			(22)
#define SPI_CH_CFG_CLEARFIFOS_Msk         	(0x1 << SPI_CH_CFG_CLEARFIFOS_Pos)
#define SPI_CH_CFG_CLEARFIFOS             	SPI_CH_CFG_CLEARFIFOS_Msk
#define SPI_CH_CFG_CONTINUEMODE_Pos			(21)
#define SPI_CH_CFG_CONTINUEMODE_Msk         (0x1 << SPI_CH_CFG_CONTINUEMODE_Pos)
#define SPI_CH_CFG_CONTINUEMODE             SPI_CH_CFG_CONTINUEMODE_Msk
#define SPI_CH_CFG_RXON_Pos					(20)
#define SPI_CH_CFG_RXON_Msk         		(0x1 << SPI_CH_CFG_RXON_Pos)
#define SPI_CH_CFG_RXON             		SPI_CH_CFG_RXON_Msk
#define SPI_CH_CFG_TXON_Pos					(19)
#define SPI_CH_CFG_TXON_Msk         		(0x1 << SPI_CH_CFG_TXON_Pos)
#define SPI_CH_CFG_TXON             		SPI_CH_CFG_TXON_Msk
#define SPI_CH_CFG_LEN_Pos					(3)
#define SPI_CH_CFG_LEN_Msk         			(0xFFFF << SPI_CH_CFG_LEN_Pos)
#define SPI_CH_CFG_LEN             			SPI_CH_CFG_LEN_Msk
#define SPI_CH_CFG_CSLEVEL_Pos				(2)
#define SPI_CH_CFG_CSLEVEL_Msk         		(0x1 << SPI_CH_CFG_CSLEVEL_Pos)
#define SPI_CH_CFG_CSLEVEL             		SPI_CH_CFG_CSLEVEL_Msk
#define SPI_CH_CFG_CSSEL_Pos				(1)
#define SPI_CH_CFG_CSSEL_Msk         		(0x1 << SPI_CH_CFG_CSSEL_Pos)
#define SPI_CH_CFG_CSSEL             		SPI_CH_CFG_CSSEL_Msk
#define SPI_CH_CFG_START_Pos				(0)
#define SPI_CH_CFG_START_Msk         		(0x1 << SPI_CH_CFG_START_Pos)
#define SPI_CH_CFG_START             		SPI_CH_CFG_START_Msk

#define SPI_SPI_CFG_FORMAT_Pos				(17)
#define SPI_SPI_CFG_FORMAT_Msk         		(0x3 << SPI_SPI_CFG_FORMAT_Pos)
#define SPI_SPI_CFG_FORMAT             		SPI_SPI_CFG_FORMAT_Msk
#define SPI_SPI_CFG_FORMAT_MOTO				(0x0 << SPI_SPI_CFG_FORMAT_Pos)
#define SPI_SPI_CFG_FORMAT_TI				(0x1 << SPI_SPI_CFG_FORMAT_Pos)
#define SPI_SPI_CFG_FORMAT_MW				(0x2 << SPI_SPI_CFG_FORMAT_Pos)
#define SPI_SPI_CFG_PINOUT_Pos				(16)
#define SPI_SPI_CFG_PINOUT_Msk         		(0x1 << SPI_SPI_CFG_PINOUT_Pos)
#define SPI_SPI_CFG_PINOUT             		SPI_SPI_CFG_PINOUT_Msk
#define SPI_SPI_CFG_CSHOLD_Pos				(12)
#define SPI_SPI_CFG_CSHOLD_Msk         		(0x7 << SPI_SPI_CFG_CSHOLD_Pos)
#define SPI_SPI_CFG_CSHOLD             		SPI_SPI_CFG_CSHOLD_Msk
#define SPI_SPI_CFG_CSHOLD_1         		(0x0 << SPI_SPI_CFG_CSHOLD_Pos)
#define SPI_SPI_CFG_CSHOLD_2         		(0x1 << SPI_SPI_CFG_CSHOLD_Pos)
#define SPI_SPI_CFG_CSHOLD_4         		(0x2 << SPI_SPI_CFG_CSHOLD_Pos)
#define SPI_SPI_CFG_CSHOLD_8         		(0x3 << SPI_SPI_CFG_CSHOLD_Pos)
#define SPI_SPI_CFG_CSHOLD_16         		(0x4 << SPI_SPI_CFG_CSHOLD_Pos)
#define SPI_SPI_CFG_CSHOLD_32         		(0x5 << SPI_SPI_CFG_CSHOLD_Pos)
#define SPI_SPI_CFG_CSHOLD_64         		(0x6 << SPI_SPI_CFG_CSHOLD_Pos)
#define SPI_SPI_CFG_CSHOLD_127         		(0x7 << SPI_SPI_CFG_CSHOLD_Pos)
#define SPI_SPI_CFG_CSSETUP_Pos				(9)
#define SPI_SPI_CFG_CSSETUP_Msk         	(0x7 << SPI_SPI_CFG_CSSETUP_Pos)
#define SPI_SPI_CFG_CSSETUP             	SPI_SPI_CFG_CSSETUP_Msk
#define SPI_SPI_CFG_CSSETUP_1         		(0x0 << SPI_SPI_CFG_CSSETUP_Pos)
#define SPI_SPI_CFG_CSSETUP_2         		(0x1 << SPI_SPI_CFG_CSSETUP_Pos)
#define SPI_SPI_CFG_CSSETUP_4         		(0x2 << SPI_SPI_CFG_CSSETUP_Pos)
#define SPI_SPI_CFG_CSSETUP_8         		(0x3 << SPI_SPI_CFG_CSSETUP_Pos)
#define SPI_SPI_CFG_CSSETUP_16         		(0x4 << SPI_SPI_CFG_CSSETUP_Pos)
#define SPI_SPI_CFG_CSSETUP_32         		(0x5 << SPI_SPI_CFG_CSSETUP_Pos)
#define SPI_SPI_CFG_CSSETUP_64         		(0x6 << SPI_SPI_CFG_CSSETUP_Pos)
#define SPI_SPI_CFG_CSSETUP_127         	(0x7 << SPI_SPI_CFG_CSSETUP_Pos)
#define SPI_SPI_CFG_OUTDELAY_Pos			(7)
#define SPI_SPI_CFG_OUTDELAY_Msk         	(0x3 << SPI_SPI_CFG_OUTDELAY_Pos)
#define SPI_SPI_CFG_OUTDELAY             	SPI_SPI_CFG_OUTDELAY_Msk
#define SPI_SPI_CFG_OUTDELAY_0         		(0x0 << SPI_SPI_CFG_OUTDELAY_Pos)
#define SPI_SPI_CFG_OUTDELAY_1         		(0x1 << SPI_SPI_CFG_OUTDELAY_Pos)
#define SPI_SPI_CFG_OUTDELAY_2         		(0x2 << SPI_SPI_CFG_OUTDELAY_Pos)
#define SPI_SPI_CFG_OUTDELAY_3         		(0x3 << SPI_SPI_CFG_OUTDELAY_Pos)
#define SPI_SPI_CFG_FRAMEDELAY_Pos			(4)
#define SPI_SPI_CFG_FRAMEDELAY_Msk         	(0x7 << SPI_SPI_CFG_FRAMEDELAY_Pos)
#define SPI_SPI_CFG_FRAMEDELAY             	SPI_SPI_CFG_FRAMEDELAY_Msk
#define SPI_SPI_CFG_FRAMEDELAY_0         	(0x0 << SPI_SPI_CFG_FRAMEDELAY_Pos)
#define SPI_SPI_CFG_FRAMEDELAY_2         	(0x1 << SPI_SPI_CFG_FRAMEDELAY_Pos)
#define SPI_SPI_CFG_FRAMEDELAY_4         	(0x2 << SPI_SPI_CFG_FRAMEDELAY_Pos)
#define SPI_SPI_CFG_FRAMEDELAY_8         	(0x3 << SPI_SPI_CFG_FRAMEDELAY_Pos)
#define SPI_SPI_CFG_FRAMEDELAY_16         	(0x4 << SPI_SPI_CFG_FRAMEDELAY_Pos)
#define SPI_SPI_CFG_FRAMEDELAY_32         	(0x5 << SPI_SPI_CFG_FRAMEDELAY_Pos)
#define SPI_SPI_CFG_FRAMEDELAY_64         	(0x6 << SPI_SPI_CFG_FRAMEDELAY_Pos)
#define SPI_SPI_CFG_FRAMEDELAY_127         	(0x7 << SPI_SPI_CFG_FRAMEDELAY_Pos)
#define SPI_SPI_CFG_BIGENDIAN_Pos			(3)
#define SPI_SPI_CFG_BIGENDIAN_Msk         	(0x1 << SPI_SPI_CFG_BIGENDIAN_Pos)
#define SPI_SPI_CFG_BIGENDIAN             	SPI_SPI_CFG_BIGENDIAN_Msk
#define SPI_SPI_CFG_MASTER_Pos				(2)
#define SPI_SPI_CFG_MASTER_Msk         		(0x1 << SPI_SPI_CFG_MASTER_Pos)
#define SPI_SPI_CFG_MASTER            		SPI_SPI_CFG_MASTER_Msk
#define SPI_SPI_CFG_CPHA_Pos				(1)
#define SPI_SPI_CFG_CPHA_Msk         		(0x1 << SPI_SPI_CFG_CPHA_Pos)
#define SPI_SPI_CFG_CPHA            		SPI_SPI_CFG_CPHA_Msk
#define SPI_SPI_CFG_CPOL_Pos				(0)
#define SPI_SPI_CFG_CPOL_Msk         		(0x1 << SPI_SPI_CFG_CPOL_Pos)
#define SPI_SPI_CFG_CPOL            		SPI_SPI_CFG_CPOL_Msk

#define SPI_CLK_CFG_DIV_Pos					(0)
#define SPI_CLK_CFG_DIV_Msk         		(0xFFFF << SPI_CLK_CFG_DIV_Pos)
#define SPI_CLK_CFG_DIV            			SPI_CLK_CFG_DIV_Msk

#define SPI_MODE_CFG_RXLEVEL_Pos			(6)
#define SPI_MODE_CFG_RXLEVEL_Msk         	(0x7 << SPI_MODE_CFG_RXLEVEL_Pos)
#define SPI_MODE_CFG_RXLEVEL            	SPI_MODE_CFG_RXLEVEL_Msk
#define SPI_MODE_CFG_TXLEVEL_Pos			(2)
#define SPI_MODE_CFG_TXLEVEL_Msk         	(0x7 << SPI_MODE_CFG_TXLEVEL_Pos)
#define SPI_MODE_CFG_TXLEVEL            	SPI_MODE_CFG_TXLEVEL_Msk
#define SPI_MODE_CFG_RXDMA_Pos				(1)
#define SPI_MODE_CFG_RXDMA_Msk         		(0x1 << SPI_MODE_CFG_RXDMA_Pos)
#define SPI_MODE_CFG_RXDMA            		SPI_MODE_CFG_RXDMA_Msk
#define SPI_MODE_CFG_TXDMA_Pos				(0)
#define SPI_MODE_CFG_TXDMA_Msk         		(0x1 << SPI_MODE_CFG_TXDMA_Pos)
#define SPI_MODE_CFG_TXDMA            		SPI_MODE_CFG_TXDMA_Msk

