pikasTech/PikaPython/bsp/w806/Include/wm_regs.h
#define SPI_INT_MASK_TIMEOUT_Pos			(7)
#define SPI_INT_MASK_TIMEOUT_Msk         	(0x1 << SPI_INT_MASK_TIMEOUT_Pos)
#define SPI_INT_MASK_TIMEOUT            	SPI_INT_MASK_TIMEOUT_Msk
#define SPI_INT_MASK_DONE_Pos				(6)
#define SPI_INT_MASK_DONE_Msk         		(0x1 << SPI_INT_MASK_DONE_Pos)
#define SPI_INT_MASK_DONE            		SPI_INT_MASK_DONE_Msk
#define SPI_INT_MASK_RXOV_Pos				(5)
#define SPI_INT_MASK_RXOV_Msk         		(0x1 << SPI_INT_MASK_RXOV_Pos)
#define SPI_INT_MASK_RXOV            		SPI_INT_MASK_RXOV_Msk
#define SPI_INT_MASK_RXUN_Pos				(4)
#define SPI_INT_MASK_RXUN_Msk         		(0x1 << SPI_INT_MASK_RXUN_Pos)
#define SPI_INT_MASK_RXUN            		SPI_INT_MASK_RXUN_Msk
#define SPI_INT_MASK_TXOV_Pos				(3)
#define SPI_INT_MASK_TXOV_Msk         		(0x1 << SPI_INT_MASK_TXOV_Pos)
#define SPI_INT_MASK_TXOV            		SPI_INT_MASK_TXOV_Msk
#define SPI_INT_MASK_TXUN_Pos				(2)
#define SPI_INT_MASK_TXUN_Msk         		(0x1 << SPI_INT_MASK_TXUN_Pos)
#define SPI_INT_MASK_TXUN            		SPI_INT_MASK_TXUN_Msk
#define SPI_INT_MASK_RXRDY_Pos				(1)
#define SPI_INT_MASK_RXRDY_Msk         		(0x1 << SPI_INT_MASK_RXRDY_Pos)
#define SPI_INT_MASK_RXRDY            		SPI_INT_MASK_RXRDY_Msk
#define SPI_INT_MASK_TXRDY_Pos				(0)
#define SPI_INT_MASK_TXRDY_Msk         		(0x1 << SPI_INT_MASK_TXRDY_Pos)
#define SPI_INT_MASK_TXRDY            		SPI_INT_MASK_TXRDY_Msk

#define SPI_INT_SRC_TIMEOUT_Pos				(7)
#define SPI_INT_SRC_TIMEOUT_Msk         	(0x1 << SPI_INT_SRC_TIMEOUT_Pos)
#define SPI_INT_SRC_TIMEOUT            		SPI_INT_SRC_TIMEOUT_Msk
#define SPI_INT_SRC_DONE_Pos				(6)
#define SPI_INT_SRC_DONE_Msk         		(0x1 << SPI_INT_SRC_DONE_Pos)
#define SPI_INT_SRC_DONE            		SPI_INT_SRC_DONE_Msk
#define SPI_INT_SRC_RXOV_Pos				(5)
#define SPI_INT_SRC_RXOV_Msk         		(0x1 << SPI_INT_SRC_RXOV_Pos)
#define SPI_INT_SRC_RXOV            		SPI_INT_SRC_RXOV_Msk
#define SPI_INT_SRC_RXUN_Pos				(4)
#define SPI_INT_SRC_RXUN_Msk         		(0x1 << SPI_INT_SRC_RXUN_Pos)
#define SPI_INT_SRC_RXUN            		SPI_INT_SRC_RXUN_Msk
#define SPI_INT_SRC_TXOV_Pos				(3)
#define SPI_INT_SRC_TXOV_Msk         		(0x1 << SPI_INT_SRC_TXOV_Pos)
#define SPI_INT_SRC_TXOV            		SPI_INT_SRC_TXOV_Msk
#define SPI_INT_SRC_TXUN_Pos				(2)
#define SPI_INT_SRC_TXUN_Msk         		(0x1 << SPI_INT_SRC_TXUN_Pos)
#define SPI_INT_SRC_TXUN            		SPI_INT_SRC_TXUN_Msk
#define SPI_INT_SRC_RXRDY_Pos				(1)
#define SPI_INT_SRC_RXRDY_Msk         		(0x1 << SPI_INT_SRC_RXRDY_Pos)
#define SPI_INT_SRC_RXRDY            		SPI_INT_SRC_RXRDY_Msk
#define SPI_INT_SRC_TXRDY_Pos				(0)
#define SPI_INT_SRC_TXRDY_Msk         		(0x1 << SPI_INT_SRC_TXRDY_Pos)
#define SPI_INT_SRC_TXRDY            		SPI_INT_SRC_TXRDY_Msk

#define SPI_STATUS_BUSY_Pos					(12)
#define SPI_STATUS_BUSY_Msk         		(0x1 << SPI_STATUS_BUSY_Pos)
#define SPI_STATUS_BUSY            			SPI_STATUS_BUSY_Msk
#define SPI_STATUS_RXFIFO_Pos				(6)
#define SPI_STATUS_RXFIFO_Msk         		(0x3F << SPI_STATUS_RXFIFO_Pos)
#define SPI_STATUS_RXFIFO            		SPI_STATUS_RXFIFO_Msk
#define SPI_STATUS_TXFIFO_Pos				(0)
#define SPI_STATUS_TXFIFO_Msk         		(0x3F << SPI_STATUS_TXFIFO_Pos)
#define SPI_STATUS_TXFIFO            		SPI_STATUS_TXFIFO_Msk

#define SPI_TIMEOUT_TIMEREN_Pos				(31)
#define SPI_TIMEOUT_TIMEREN_Msk         	(0x1 << SPI_TIMEOUT_TIMEREN_Pos)
#define SPI_TIMEOUT_TIMEREN            		SPI_TIMEOUT_TIMEREN_Msk
#define SPI_TIMEOUT_TIMERVAL_Pos			(0)
#define SPI_TIMEOUT_TIMERVAL_Msk         	(0x7FFFFFFF << SPI_TIMEOUT_TIMERVAL_Pos)
#define SPI_TIMEOUT_TIMERVAL            	SPI_TIMEOUT_TIMERVAL_Msk

#define SPI_TRANS_MODE_BLKLEN_Pos			(24)
#define SPI_TRANS_MODE_BLKLEN_Msk         	(0x3F << SPI_TRANS_MODE_BLKLEN_Pos)
#define SPI_TRANS_MODE_BLKLEN            	SPI_TRANS_MODE_BLKLEN_Msk
#define SPI_TRANS_MODE_MICROBURST_Pos		(16)
#define SPI_TRANS_MODE_MICROBURST_Msk       (0x1 << SPI_TRANS_MODE_MICROBURST_Pos)
#define SPI_TRANS_MODE_MICROBURST           SPI_TRANS_MODE_MICROBURST_Msk
#define SPI_TRANS_MODE_MICRODATLEN_Pos		(8)
#define SPI_TRANS_MODE_MICRODATLEN_Msk      (0x3F << SPI_TRANS_MODE_MICRODATLEN_Pos)
#define SPI_TRANS_MODE_MICRODATLEN          SPI_TRANS_MODE_MICRODATLEN_Msk
#define SPI_TRANS_MODE_MICROCONTROLLEN_Pos	(0)
#define SPI_TRANS_MODE_MICROCONTROLLEN_Msk  (0x3F << SPI_TRANS_MODE_MICROCONTROLLEN_Pos)
#define SPI_TRANS_MODE_MICROCONTROLLEN      SPI_TRANS_MODE_MICROCONTROLLEN_Msk

#define SPI_SLV_LEN_TXLEN_Pos				(16)
#define SPI_SLV_LEN_TXLEN_Msk  				(0xFFFF << SPI_SLV_LEN_TXLEN_Pos)
#define SPI_SLV_LEN_TXLEN      				SPI_SLV_LEN_TXLEN_Msk
#define SPI_SLV_LEN_RXLEN_Pos				(0)
#define SPI_SLV_LEN_RXLEN_Msk  				(0xFFFF << SPI_SLV_LEN_RXLEN_Pos)
#define SPI_SLV_LEN_RXLEN      				SPI_SLV_LEN_RXLEN_Msk


/***************************************************************
 * UART Reg
 ***************************************************************/

#define UART0_BASE	(HR_APB_BASE_ADDR + 0x600)
#define UART1_BASE	(HR_APB_BASE_ADDR + 0x800)
#define UART2_BASE	(HR_APB_BASE_ADDR + 0xA00)
#define UART3_BASE	(HR_APB_BASE_ADDR + 0xC00)
#define UART4_BASE	(HR_APB_BASE_ADDR + 0xE00)
#define UART5_BASE	(HR_APB_BASE_ADDR + 0x1000)

typedef struct
{
	__IOM uint32_t LC;
	__IOM uint32_t FC;
	__IOM uint32_t DMAC;
	__IOM uint32_t FIFOC;
	__IOM uint32_t BAUDR;
	__IOM uint32_t INTM;
	__IOM uint32_t INTS;
	__IOM uint32_t FIFOS;
	__OM uint32_t TDW;
	__IOM uint32_t RSV1;
	__IOM uint32_t RSV2;
	__IOM uint32_t RSV3;
	__IM uint32_t RDW;
} USART_TypeDef;

#define UART_LC_RE_Pos						(7)
#define UART_LC_RE_Msk                     	(0x1 << UART_LC_RE_Pos)
#define UART_LC_RE                         	UART_LC_RE_Msk
#define UART_LC_TE_Pos                     	(6)
#define UART_LC_TE_Msk                     	(0x1 << UART_LC_TE_Pos)
#define UART_LC_TE                         	UART_LC_TE_Msk
#define UART_LC_SBE_Pos                    	(5)
#define UART_LC_SBE_Msk                    	(0x1 << UART_LC_SBE_Pos)
#define UART_LC_SBE                        	UART_LC_SBE_Msk
#define UART_LC_PS_Pos                     	(4)
#define UART_LC_PS_Msk                     	(0x1 << UART_LC_PS_Pos)
#define UART_LC_PS                         	UART_LC_PS_Msk
#define UART_LC_PCE_Pos                    	(3)
#define UART_LC_PCE_Msk                    	(0x1 << UART_LC_PCE_Pos)
#define UART_LC_PCE                        	UART_LC_PCE_Msk
#define UART_LC_STOP_Pos                   	(2)
#define UART_LC_STOP_Msk                   	(0x1 << UART_LC_STOP_Pos)
#define UART_LC_STOP                       	UART_LC_STOP_Msk
#define UART_LC_DATAL_Pos                  	(0)
#define UART_LC_DATAL_Msk                  	(0x3 << UART_LC_DATAL_Pos)
#define UART_LC_DATAL                      	UART_LC_DATAL_Msk
#define UART_LC_DATAL_5BIT					(0x0 << UART_LC_DATAL_Pos)
#define UART_LC_DATAL_6BIT					(0x1 << UART_LC_DATAL_Pos)
#define UART_LC_DATAL_7BIT					(0x2 << UART_LC_DATAL_Pos)
#define UART_LC_DATAL_8BIT					(0x3 << UART_LC_DATAL_Pos)

#define UART_FC_RTSL_Pos					(2)
#define UART_FC_RTSL_Msk                    (0x7 << UART_FC_RTSL_Pos)
#define UART_FC_RTSL                        UART_FC_RTSL_Msk
#define UART_FC_RTSL_4                     	(0x0 << UART_FC_RTSL_Pos)
#define UART_FC_RTSL_8                     	(0x1 << UART_FC_RTSL_Pos)
#define UART_FC_RTSL_12                     (0x2 << UART_FC_RTSL_Pos)
#define UART_FC_RTSL_16                     (0x3 << UART_FC_RTSL_Pos)
#define UART_FC_RTSL_20                     (0x4 << UART_FC_RTSL_Pos)
#define UART_FC_RTSL_24                     (0x5 << UART_FC_RTSL_Pos)
#define UART_FC_RTSL_28                     (0x6 << UART_FC_RTSL_Pos)
#define UART_FC_RTSL_31                     (0x7 << UART_FC_RTSL_Pos)
#define UART_FC_RTSS_Pos					(1)
#define UART_FC_RTSS_Msk                    (0x1 << UART_FC_RTSS_Pos)
#define UART_FC_RTSS                        UART_FC_RTSS_Msk
#define UART_FC_AFCE_Pos					(0)
#define UART_FC_AFCE_Msk                    (0x1 << UART_FC_AFCE_Pos)
#define UART_FC_AFCE                        UART_FC_AFCE_Msk

#define UART_DMAC_RTO_Pos					(3)
#define UART_DMAC_RTO_Msk                   (0x1F << UART_DMAC_RTO_Pos)
#define UART_DMAC_RTO                       UART_DMAC_RTO_Msk
#define UART_DMAC_RTOE_Pos					(2)
#define UART_DMAC_RTOE_Msk                  (0x1 << UART_DMAC_RTOE_Pos)
#define UART_DMAC_RTOE                      UART_DMAC_RTOE_Msk
#define UART_DMAC_RDE_Pos					(1)
#define UART_DMAC_RDE_Msk                   (0x1 << UART_DMAC_RDE_Pos)
#define UART_DMAC_RDE                       UART_DMAC_RDE_Msk
#define UART_DMAC_TDE_Pos					(0)
#define UART_DMAC_TDE_Msk                   (0x1 << UART_DMAC_TDE_Pos)
#define UART_DMAC_TDE                       UART_DMAC_TDE_Msk

#define UART_FIFOC_RFL_Pos					(4)
#define UART_FIFOC_RFL_Msk                  (0x3 << UART_FIFOC_RFL_Pos)
#define UART_FIFOC_RFL                      UART_FIFOC_RFL_Msk
#define UART_FIFOC_RFL_1                  	(0x0 << UART_FIFOC_RFL_Pos)
#define UART_FIFOC_RFL_4                  	(0x1 << UART_FIFOC_RFL_Pos)
#define UART_FIFOC_RFL_8                  	(0x2 << UART_FIFOC_RFL_Pos)
#define UART_FIFOC_RFL_16                  	(0x3 << UART_FIFOC_RFL_Pos)
#define UART_FIFOC_TFL_Pos					(2)
#define UART_FIFOC_TFL_Msk                  (0x3 << UART_FIFOC_TFL_Pos)
#define UART_FIFOC_TFL                      UART_FIFOC_TFL_Msk
#define UART_FIFOC_TFL_0                  	(0x0 << UART_FIFOC_TFL_Pos)
#define UART_FIFOC_TFL_4                  	(0x1 << UART_FIFOC_TFL_Pos)
#define UART_FIFOC_TFL_8                  	(0x2 << UART_FIFOC_TFL_Pos)
#define UART_FIFOC_TFL_16                  	(0x3 << UART_FIFOC_TFL_Pos)
#define UART_FIFOC_RFRST_Pos				(1)
#define UART_FIFOC_RFRST_Msk                (0x1 << UART_FIFOC_RFRST_Pos)
#define UART_FIFOC_RFRST                    UART_FIFOC_RFRST_Msk
#define UART_FIFOC_TFRST_Pos				(0)
#define UART_FIFOC_TFRST_Msk                (0x1 << UART_FIFOC_TFRST_Pos)
#define UART_FIFOC_TFRST                    UART_FIFOC_TFRST_Msk

#define UART_BAUDR_DIVF_Pos					(16)
#define UART_BAUDR_DIVF_Msk                	(0xF << UART_BAUDR_DIVF_Pos)
#define UART_BAUDR_DIVF                    	UART_BAUDR_DIVF_Msk
#define UART_BAUDR_DIV_Pos					(0)
#define UART_BAUDR_DIV_Msk                	(0xFFFF << UART_BAUDR_DIV_Pos)
#define UART_BAUDR_DIV                    	UART_BAUDR_DIV_Msk

