pikasTech/PikaPython/bsp/w806/Include/wm_regs.h
#define UART_INTM_OE_Pos					(8)
#define UART_INTM_OE_Msk                	(0x1 << UART_INTM_OE_Pos)
#define UART_INTM_OE                    	UART_INTM_OE_Msk
#define UART_INTM_PE_Pos					(7)
#define UART_INTM_PE_Msk                	(0x1 << UART_INTM_PE_Pos)
#define UART_INTM_PE                    	UART_INTM_PE_Msk
#define UART_INTM_FE_Pos					(6)
#define UART_INTM_FE_Msk                	(0x1 << UART_INTM_FE_Pos)
#define UART_INTM_FE                    	UART_INTM_FE_Msk
#define UART_INTM_BD_Pos					(5)
#define UART_INTM_BD_Msk                	(0x1 << UART_INTM_BD_Pos)
#define UART_INTM_BD                    	UART_INTM_BD_Msk
#define UART_INTM_CTS_Pos					(4)
#define UART_INTM_CTS_Msk                	(0x1 << UART_INTM_CTS_Pos)
#define UART_INTM_CTS                    	UART_INTM_CTS_Msk
#define UART_INTM_RTO_Pos					(3)
#define UART_INTM_RTO_Msk                	(0x1 << UART_INTM_RTO_Pos)
#define UART_INTM_RTO                    	UART_INTM_RTO_Msk
#define UART_INTM_RL_Pos					(2)
#define UART_INTM_RL_Msk                	(0x1 << UART_INTM_RL_Pos)
#define UART_INTM_RL                    	UART_INTM_RL_Msk
#define UART_INTM_TL_Pos					(1)
#define UART_INTM_TL_Msk                	(0x1 << UART_INTM_TL_Pos)
#define UART_INTM_TL                    	UART_INTM_TL_Msk
#define UART_INTM_TEMPT_Pos					(0)
#define UART_INTM_TEMPT_Msk                	(0x1 << UART_INTM_TEMPT_Pos)
#define UART_INTM_TEMPT                    	UART_INTM_TEMPT_Msk

#define UART_INTS_OE_Pos					(8)
#define UART_INTS_OE_Msk                	(0x1 << UART_INTS_OE_Pos)
#define UART_INTS_OE                    	UART_INTS_OE_Msk
#define UART_INTS_PE_Pos					(7)
#define UART_INTS_PE_Msk                	(0x1 << UART_INTS_PE_Pos)
#define UART_INTS_PE                    	UART_INTS_PE_Msk
#define UART_INTS_FE_Pos					(6)
#define UART_INTS_FE_Msk                	(0x1 << UART_INTS_FE_Pos)
#define UART_INTS_FE                    	UART_INTS_FE_Msk
#define UART_INTS_BD_Pos					(5)
#define UART_INTS_BD_Msk                	(0x1 << UART_INTS_BD_Pos)
#define UART_INTS_BD                    	UART_INTS_BD_Msk
#define UART_INTS_CTS_Pos					(4)
#define UART_INTS_CTS_Msk                	(0x1 << UART_INTS_CTS_Pos)
#define UART_INTS_CTS                    	UART_INTS_CTS_Msk
#define UART_INTS_RTO_Pos					(3)
#define UART_INTS_RTO_Msk                	(0x1 << UART_INTS_RTO_Pos)
#define UART_INTS_RTO                    	UART_INTS_RTO_Msk
#define UART_INTS_RL_Pos					(2)
#define UART_INTS_RL_Msk                	(0x1 << UART_INTS_RL_Pos)
#define UART_INTS_RL                    	UART_INTS_RL_Msk
#define UART_INTS_TL_Pos					(1)
#define UART_INTS_TL_Msk                	(0x1 << UART_INTS_TL_Pos)
#define UART_INTS_TL                    	UART_INTS_TL_Msk
#define UART_INTS_TEMPT_Pos					(0)
#define UART_INTS_TEMPT_Msk                	(0x1 << UART_INTS_TEMPT_Pos)
#define UART_INTS_TEMPT                    	UART_INTS_TEMPT_Msk

#define UART_FIFOS_CTSS_Pos					(12)
#define UART_FIFOS_CTSS_Msk                	(0x1 << UART_FIFOS_CTSS_Pos)
#define UART_FIFOS_CTSS                    	UART_FIFOS_CTSS_Msk
#define UART_FIFOS_RFC_Pos					(6)
#define UART_FIFOS_RFC_Msk                	(0x3F << UART_FIFOS_RFC_Pos)
#define UART_FIFOS_RFC                    	UART_FIFOS_RFC_Msk
#define UART_FIFOS_TFC_Pos					(0)
#define UART_FIFOS_TFC_Msk                	(0x3F << UART_FIFOS_TFC_Pos)
#define UART_FIFOS_TFC                    	UART_FIFOS_TFC_Msk


/***************************************************************
 * TIM Reg
 ***************************************************************/
 
#define TIM_BASE		(HR_APB_BASE_ADDR + 0x00001800)

typedef struct
{
	__IOM uint32_t TMR_CONFIG;
	__IOM uint32_t CR;
	__IOM uint32_t TIM0_PRD;
	__IOM uint32_t TIM1_PRD;
	__IOM uint32_t TIM2_PRD;
	__IOM uint32_t TIM3_PRD;
	__IOM uint32_t TIM4_PRD;
	__IOM uint32_t TIM5_PRD;
	__IM uint32_t TIM0_CNT;
	__IM uint32_t TIM1_CNT;
	__IM uint32_t TIM2_CNT;
	__IM uint32_t TIM3_CNT;
	__IM uint32_t TIM4_CNT;
	__IM uint32_t TIM5_CNT;
	
} TIM_TypeDef;

#define TIM_TMR_CONFIG_DIV_Pos					(0)
#define TIM_TMR_CONFIG_DIV_Msk					(0x7F << TIM_TMR_CONFIG_DIV_Pos)
#define TIM_TMR_CONFIG_DIV						TIM_TMR_CONFIG_DIV_Msk

#define TIM_CR_TIM5_TIF_Pos						(29)
#define TIM_CR_TIM5_TIF_Msk						(0x1 << TIM_CR_TIM5_TIF_Pos)
#define TIM_CR_TIM5_TIF							TIM_CR_TIM5_TIF_Msk
#define TIM_CR_TIM5_TIE_Pos						(28)
#define TIM_CR_TIM5_TIE_Msk						(0x1 << TIM_CR_TIM5_TIE_Pos)
#define TIM_CR_TIM5_TIE							TIM_CR_TIM5_TIE_Msk
#define TIM_CR_TIM5_EN_Pos						(27)
#define TIM_CR_TIM5_EN_Msk						(0x1 << TIM_CR_TIM5_EN_Pos)
#define TIM_CR_TIM5_EN							TIM_CR_TIM5_EN_Msk
#define TIM_CR_TIM5_MODE_Pos					(26)
#define TIM_CR_TIM5_MODE_Msk					(0x1 << TIM_CR_TIM5_MODE_Pos)
#define TIM_CR_TIM5_MODE						TIM_CR_TIM5_MODE_Msk
#define TIM_CR_TIM5_UNIT_Pos					(25)
#define TIM_CR_TIM5_UNIT_Msk					(0x1 << TIM_CR_TIM5_UNIT_Pos)
#define TIM_CR_TIM5_UNIT						TIM_CR_TIM5_UNIT_Msk
#define TIM_CR_TIM4_TIF_Pos						(24)
#define TIM_CR_TIM4_TIF_Msk						(0x1 << TIM_CR_TIM4_TIF_Pos)
#define TIM_CR_TIM4_TIF							TIM_CR_TIM4_TIF_Msk
#define TIM_CR_TIM4_TIE_Pos						(23)
#define TIM_CR_TIM4_TIE_Msk						(0x1 << TIM_CR_TIM4_TIE_Pos)
#define TIM_CR_TIM4_TIE							TIM_CR_TIM4_TIE_Msk
#define TIM_CR_TIM4_EN_Pos						(22)
#define TIM_CR_TIM4_EN_Msk						(0x1 << TIM_CR_TIM4_EN_Pos)
#define TIM_CR_TIM4_EN							TIM_CR_TIM4_EN_Msk
#define TIM_CR_TIM4_MODE_Pos					(21)
#define TIM_CR_TIM4_MODE_Msk					(0x1 << TIM_CR_TIM4_MODE_Pos)
#define TIM_CR_TIM4_MODE						TIM_CR_TIM4_MODE_Msk
#define TIM_CR_TIM4_UNIT_Pos					(20)
#define TIM_CR_TIM4_UNIT_Msk					(0x1 << TIM_CR_TIM4_UNIT_Pos)
#define TIM_CR_TIM4_UNIT						TIM_CR_TIM4_UNIT_Msk
#define TIM_CR_TIM3_TIF_Pos						(19)
#define TIM_CR_TIM3_TIF_Msk						(0x1 << TIM_CR_TIM3_TIF_Pos)
#define TIM_CR_TIM3_TIF							TIM_CR_TIM3_TIF_Msk
#define TIM_CR_TIM3_TIE_Pos						(18)
#define TIM_CR_TIM3_TIE_Msk						(0x1 << TIM_CR_TIM3_TIE_Pos)
#define TIM_CR_TIM3_TIE							TIM_CR_TIM3_TIE_Msk
#define TIM_CR_TIM3_EN_Pos						(17)
#define TIM_CR_TIM3_EN_Msk						(0x1 << TIM_CR_TIM3_EN_Pos)
#define TIM_CR_TIM3_EN							TIM_CR_TIM3_EN_Msk
#define TIM_CR_TIM3_MODE_Pos					(16)
#define TIM_CR_TIM3_MODE_Msk					(0x1 << TIM_CR_TIM3_MODE_Pos)
#define TIM_CR_TIM3_MODE						TIM_CR_TIM3_MODE_Msk
#define TIM_CR_TIM3_UNIT_Pos					(15)
#define TIM_CR_TIM3_UNIT_Msk					(0x1 << TIM_CR_TIM3_UNIT_Pos)
#define TIM_CR_TIM3_UNIT						TIM_CR_TIM3_UNIT_Msk
#define TIM_CR_TIM2_TIF_Pos						(14)
#define TIM_CR_TIM2_TIF_Msk						(0x1 << TIM_CR_TIM2_TIF_Pos)
#define TIM_CR_TIM2_TIF							TIM_CR_TIM2_TIF_Msk
#define TIM_CR_TIM2_TIE_Pos						(13)
#define TIM_CR_TIM2_TIE_Msk						(0x1 << TIM_CR_TIM2_TIE_Pos)
#define TIM_CR_TIM2_TIE							TIM_CR_TIM2_TIE_Msk
#define TIM_CR_TIM2_EN_Pos						(12)
#define TIM_CR_TIM2_EN_Msk						(0x1 << TIM_CR_TIM2_EN_Pos)
#define TIM_CR_TIM2_EN							TIM_CR_TIM2_EN_Msk
#define TIM_CR_TIM2_MODE_Pos					(11)
#define TIM_CR_TIM2_MODE_Msk					(0x1 << TIM_CR_TIM2_MODE_Pos)
#define TIM_CR_TIM2_MODE						TIM_CR_TIM2_MODE_Msk
#define TIM_CR_TIM2_UNIT_Pos					(10)
#define TIM_CR_TIM2_UNIT_Msk					(0x1 << TIM_CR_TIM2_UNIT_Pos)
#define TIM_CR_TIM2_UNIT						TIM_CR_TIM2_UNIT_Msk
#define TIM_CR_TIM1_TIF_Pos						(9)
#define TIM_CR_TIM1_TIF_Msk						(0x1 << TIM_CR_TIM1_TIF_Pos)
#define TIM_CR_TIM1_TIF							TIM_CR_TIM1_TIF_Msk
#define TIM_CR_TIM1_TIE_Pos						(8)
#define TIM_CR_TIM1_TIE_Msk						(0x1 << TIM_CR_TIM1_TIE_Pos)
#define TIM_CR_TIM1_TIE							TIM_CR_TIM1_TIE_Msk
#define TIM_CR_TIM1_EN_Pos						(7)
#define TIM_CR_TIM1_EN_Msk						(0x1 << TIM_CR_TIM1_EN_Pos)
#define TIM_CR_TIM1_EN							TIM_CR_TIM1_EN_Msk
#define TIM_CR_TIM1_MODE_Pos					(6)
#define TIM_CR_TIM1_MODE_Msk					(0x1 << TIM_CR_TIM1_MODE_Pos)
#define TIM_CR_TIM1_MODE						TIM_CR_TIM1_MODE_Msk
#define TIM_CR_TIM1_UNIT_Pos					(5)
#define TIM_CR_TIM1_UNIT_Msk					(0x1 << TIM_CR_TIM1_UNIT_Pos)
#define TIM_CR_TIM1_UNIT						TIM_CR_TIM1_UNIT_Msk
#define TIM_CR_TIM0_TIF_Pos						(4)
#define TIM_CR_TIM0_TIF_Msk						(0x1 << TIM_CR_TIM0_TIF_Pos)
#define TIM_CR_TIM0_TIF							TIM_CR_TIM0_TIF_Msk
#define TIM_CR_TIM0_TIE_Pos						(3)
#define TIM_CR_TIM0_TIE_Msk						(0x1 << TIM_CR_TIM0_TIE_Pos)
#define TIM_CR_TIM0_TIE							TIM_CR_TIM0_TIE_Msk
#define TIM_CR_TIM0_EN_Pos						(2)
#define TIM_CR_TIM0_EN_Msk						(0x1 << TIM_CR_TIM0_EN_Pos)
#define TIM_CR_TIM0_EN							TIM_CR_TIM0_EN_Msk
#define TIM_CR_TIM0_MODE_Pos					(1)
#define TIM_CR_TIM0_MODE_Msk					(0x1 << TIM_CR_TIM0_MODE_Pos)
#define TIM_CR_TIM0_MODE						TIM_CR_TIM0_MODE_Msk
#define TIM_CR_TIM0_UNIT_Pos					(0)
#define TIM_CR_TIM0_UNIT_Msk					(0x1 << TIM_CR_TIM0_UNIT_Pos)
#define TIM_CR_TIM0_UNIT						TIM_CR_TIM0_UNIT_Msk

#define TIM_CR_TIM_TIF_Pos(n)					(4  + 5 * n)
#define TIM_CR_TIM_TIF_Msk(n)					(0x1 << TIM_CR_TIM_TIF_Pos(n))
#define TIM_CR_TIM_TIF(n)						TIM_CR_TIM_TIF_Msk(n)
#define TIM_CR_TIM_TIE_Pos(n)					(3  + 5 * n)
#define TIM_CR_TIM_TIE_Msk(n)					(0x1 << TIM_CR_TIM_TIE_Pos(n))
#define TIM_CR_TIM_TIE(n)						TIM_CR_TIM_TIE_Msk(n)
#define TIM_CR_TIM_EN_Pos(n)					(2  + 5 * n)
#define TIM_CR_TIM_EN_Msk(n)					(0x1 << TIM_CR_TIM_EN_Pos(n))
#define TIM_CR_TIM_EN(n)						TIM_CR_TIM_EN_Msk(n)
#define TIM_CR_TIM_MODE_Pos(n)					(1  + 5 * n)
#define TIM_CR_TIM_MODE_Msk(n)					(0x1 << TIM_CR_TIM_MODE_Pos(n))
#define TIM_CR_TIM_MODE(n)						TIM_CR_TIM_MODE_Msk(n)
#define TIM_CR_TIM_UNIT_Pos(n)					(0  + 5 * n)
#define TIM_CR_TIM_UNIT_Msk(n)					(0x1 << TIM_CR_TIM_UNIT_Pos(n))
#define TIM_CR_TIM_UNIT(n)						TIM_CR_TIM_UNIT_Msk(n)

#define TIM_TIM0_PRD_Pos						(0)
#define TIM_TIM0_PRD_Msk						(0xFFFFFFFF << TIM_TIM0_PRD_Pos)
#define TIM_TIM0_PRD							TIM_TIM0_PRD_Msk

#define TIM_TIM1_PRD_Pos						(0)
#define TIM_TIM1_PRD_Msk						(0xFFFFFFFF << TIM_TIM1_PRD_Pos)
#define TIM_TIM1_PRD							TIM_TIM1_PRD_Msk

