pikasTech/PikaPython/bsp/w806/Include/wm_regs.h
#define TIM_TIM2_PRD_Pos						(0)
#define TIM_TIM2_PRD_Msk						(0xFFFFFFFF << TIM_TIM2_PRD_Pos)
#define TIM_TIM2_PRD							TIM_TIM2_PRD_Msk

#define TIM_TIM3_PRD_Pos						(0)
#define TIM_TIM3_PRD_Msk						(0xFFFFFFFF << TIM_TIM3_PRD_Pos)
#define TIM_TIM3_PRD							TIM_TIM3_PRD_Msk

#define TIM_TIM4_PRD_Pos						(0)
#define TIM_TIM4_PRD_Msk						(0xFFFFFFFF << TIM_TIM4_PRD_Pos)
#define TIM_TIM4_PRD							TIM_TIM4_PRD_Msk

#define TIM_TIM5_PRD_Pos						(0)
#define TIM_TIM5_PRD_Msk						(0xFFFFFFFF << TIM_TIM5_PRD_Pos)
#define TIM_TIM5_PRD							TIM_TIM5_PRD_Msk

#define TIM_TIM0_CNT_Pos						(0)
#define TIM_TIM0_CNT_Msk						(0xFFFFFFFF << TIM_TIM0_CNT_Pos)
#define TIM_TIM0_CNT							TIM_TIM0_CNT_Msk

#define TIM_TIM1_CNT_Pos						(0)
#define TIM_TIM1_CNT_Msk						(0xFFFFFFFF << TIM_TIM1_CNT_Pos)
#define TIM_TIM1_CNT							TIM_TIM1_CNT_Msk

#define TIM_TIM2_CNT_Pos						(0)
#define TIM_TIM2_CNT_Msk						(0xFFFFFFFF << TIM_TIM2_CNT_Pos)
#define TIM_TIM2_CNT							TIM_TIM2_CNT_Msk

#define TIM_TIM3_CNT_Pos						(0)
#define TIM_TIM3_CNT_Msk						(0xFFFFFFFF << TIM_TIM3_CNT_Pos)
#define TIM_TIM3_CNT							TIM_TIM3_CNT_Msk

#define TIM_TIM4_CNT_Pos						(0)
#define TIM_TIM4_CNT_Msk						(0xFFFFFFFF << TIM_TIM4_CNT_Pos)
#define TIM_TIM4_CNT							TIM_TIM4_CNT_Msk

#define TIM_TIM5_CNT_Pos						(0)
#define TIM_TIM5_CNT_Msk						(0xFFFFFFFF << TIM_TIM5_CNT_Pos)
#define TIM_TIM5_CNT							TIM_TIM5_CNT_Msk


/***************************************************************
 * WDG Reg
 ***************************************************************/

#define WDG_BASE				(HR_APB_BASE_ADDR + 0x1600)	

typedef struct
{
	__IOM uint32_t LD;
	__IM uint32_t VAL;
	__IOM uint32_t CR;
	__OM uint32_t CLR;
	__IM uint32_t SRC;
	__IM uint32_t STATE;
} WDG_TypeDef;

#define WDG_LD_Pos						(0)
#define WDG_LD_Msk						(0xFFFFFFFF << WDG_LD_Pos)
#define WDG_LD							WDG_LD_Msk

#define WDG_VAL_Pos						(0)
#define WDG_VAL_Msk						(0xFFFFFFFF << WDG_VAL_Pos)
#define WDG_VAL							WDG_VAL_Msk

#define WDG_CR_RST_EN_Pos				(1)
#define WDG_CR_RST_EN_Msk				(0x1 << WDG_CR_RST_EN_Pos)
#define WDG_CR_RST_EN					WDG_CR_RST_EN_Msk
#define WDG_CR_EN_Pos					(0)
#define WDG_CR_EN_Msk					(0x1 << WDG_CR_EN_Pos)
#define WDG_CR_EN						WDG_CR_EN_Msk

#define WDG_CLR_Pos						(0)
#define WDG_CLR_Msk						(0x1 << WDG_CLR_Pos)
#define WDG_CLR							WDG_CLR_Msk

#define WDG_SRC_Pos						(0)
#define WDG_SRC_Msk						(0x1 << WDG_SRC_Pos)
#define WDG_SRC							WDG_SRC_Msk

#define WDG_STATE_Pos					(0)
#define WDG_STATE_Msk					(0x1 << WDG_STATE_Pos)
#define WDG_STATE						WDG_STATE_Msk


/***************************************************************
 * LCD Reg
 ***************************************************************/
#define LCD_REG_BASE     		 (HR_APB_BASE_ADDR + 0x1C00) //(0x4001 1C00)

typedef struct
{
	__IO uint32_t CTRL;     /** Control Register */
	__IO uint32_t FRAMECNT; /** Refresh Rate Prescaler Register */
	__IO uint32_t RAM0;
	__IO uint32_t RAM1;
	__IO uint32_t RAM2;
	__IO uint32_t RAM3;
	__IO uint32_t RAM4;
	__IO uint32_t RAM5;
	__IO uint32_t RAM6;
	__IO uint32_t RAM7;
	__IO uint32_t COM_EN;   /** LCD COM Control Register */
	__IO uint32_t SEG_EN;   /** LCD SEG Control Register */
} LCD_T;

/** LCD base pointer */
#define LCD 		((LCD_T *)LCD_REG_BASE)

/***************************************************************
 * PWM Reg
 ***************************************************************/
 
#define PWM_BASE				(HR_APB_BASE_ADDR + 0x1E00)

typedef struct
{
	__IOM uint32_t CLKDIV01;
	__IOM uint32_t CLKDIV23;
	__IOM uint32_t CR;
	__IOM uint32_t PERIOD;
	__IOM uint32_t PNUM;
	__IOM uint32_t CMPDAT;
	__IOM uint32_t DTCR;
	__IOM uint32_t IE;
	__IOM uint32_t IF;
	__IM uint32_t CH0CAPDAT;
	__IOM uint32_t BKCR;
	__IOM uint32_t CH4CR1;
	__IOM uint32_t CH4CR2;
	__IM uint32_t CH4CAPDAT;
	__IOM uint32_t CH4CR3;
	
} PWM_TypeDef;

#define PWM_CLKDIV01_CH1_Pos			(16)
#define PWM_CLKDIV01_CH1_Msk			(0xFFFF << PWM_CLKDIV01_CH1_Pos)
#define PWM_CLKDIV01_CH1				PWM_CLKDIV01_CH1_Msk
#define PWM_CLKDIV01_CH0_Pos			(0)
#define PWM_CLKDIV01_CH0_Msk			(0xFFFF << PWM_CLKDIV01_CH0_Pos)
#define PWM_CLKDIV01_CH0				PWM_CLKDIV01_CH0_Msk

#define PWM_CLKDIV23_CH3_Pos			(16)
#define PWM_CLKDIV23_CH3_Msk			(0xFFFF << PWM_CLKDIV23_CH3_Pos)
#define PWM_CLKDIV23_CH3				PWM_CLKDIV23_CH3_Msk
#define PWM_CLKDIV23_CH2_Pos			(0)
#define PWM_CLKDIV23_CH2_Msk			(0xFFFF << PWM_CLKDIV23_CH2_Pos)
#define PWM_CLKDIV23_CH2				PWM_CLKDIV23_CH2_Msk

#define PWM_CR_CNTEN_Pos				(27)
#define PWM_CR_CNTEN_Msk				(0x1F << PWM_CR_CNTEN_Pos)
#define PWM_CR_CNTEN					PWM_CR_CNTEN_Msk
#define PWM_CR_CAPINV_Pos				(25)
#define PWM_CR_CAPINV_Msk				(0x1 << PWM_CR_CAPINV_Pos)
#define PWM_CR_CAPINV					PWM_CR_CAPINV_Msk
#define PWM_CR_CPEN_Pos					(24)
#define PWM_CR_CPEN_Msk					(0x1 << PWM_CR_CPEN_Pos)
#define PWM_CR_CPEN						PWM_CR_CPEN_Msk
#define PWM_CR_CNTTYPE3_Pos				(22)
#define PWM_CR_CNTTYPE3_Msk				(0x3 << PWM_CR_CNTTYPE3_Pos)
#define PWM_CR_CNTTYPE3					PWM_CR_CNTTYPE3_Msk
#define PWM_CR_CNTTYPE2_Pos				(20)
#define PWM_CR_CNTTYPE2_Msk				(0x3 << PWM_CR_CNTTYPE2_Pos)
#define PWM_CR_CNTTYPE2					PWM_CR_CNTTYPE2_Msk
#define PWM_CR_CNTTYPE1_Pos				(18)
#define PWM_CR_CNTTYPE1_Msk				(0x3 << PWM_CR_CNTTYPE1_Pos)
#define PWM_CR_CNTTYPE1					PWM_CR_CNTTYPE1_Msk
#define PWM_CR_CNTTYPE0_Pos				(16)
#define PWM_CR_CNTTYPE0_Msk				(0x3 << PWM_CR_CNTTYPE0_Pos)
#define PWM_CR_CNTTYPE0					PWM_CR_CNTTYPE0_Msk
#define PWM_CR_TWOSYNCEN_Pos			(14)
#define PWM_CR_TWOSYNCEN_Msk			(0x3 << PWM_CR_TWOSYNCEN_Pos)
#define PWM_CR_TWOSYNCEN				PWM_CR_TWOSYNCEN_Msk
#define PWM_CR_POEN_Pos					(12)
#define PWM_CR_POEN_Msk					(0x1 << PWM_CR_POEN_Pos)
#define PWM_CR_POEN						PWM_CR_POEN_Msk
#define PWM_CR_CNTMODE_Pos				(8)
#define PWM_CR_CNTMODE_Msk				(0xF << PWM_CR_CNTMODE_Pos)
#define PWM_CR_CNTMODE					PWM_CR_CNTMODE_Msk
#define PWM_CR_ALLSYNCEN_Pos			(6)
#define PWM_CR_ALLSYNCEN_Msk			(0x1 << PWM_CR_ALLSYNCEN_Pos)
#define PWM_CR_ALLSYNCEN				PWM_CR_ALLSYNCEN_Msk
#define PWM_CR_PINV_Pos					(2)
#define PWM_CR_PINV_Msk					(0xF << PWM_CR_PINV_Pos)
#define PWM_CR_PINV						PWM_CR_PINV_Msk
#define PWM_CR_2COMPLEMENTARY_Pos		(0)
#define PWM_CR_2COMPLEMENTARY_Msk		(0x3 << PWM_CR_2COMPLEMENTARY_Pos)
#define PWM_CR_2COMPLEMENTARY			PWM_CR_2COMPLEMENTARY_Msk

#define PWM_PERIOD_CH3_Pos				(24)
#define PWM_PERIOD_CH3_Msk				(0xFF << PWM_PERIOD_CH3_Pos)
#define PWM_PERIOD_CH3					PWM_PERIOD_CH3_Msk
#define PWM_PERIOD_CH2_Pos				(16)
#define PWM_PERIOD_CH2_Msk				(0xFF << PWM_PERIOD_CH2_Pos)
#define PWM_PERIOD_CH2					PWM_PERIOD_CH2_Msk
#define PWM_PERIOD_CH1_Pos				(8)
#define PWM_PERIOD_CH1_Msk				(0xFF << PWM_PERIOD_CH1_Pos)
#define PWM_PERIOD_CH1					PWM_PERIOD_CH1_Msk
#define PWM_PERIOD_CH0_Pos				(0)
#define PWM_PERIOD_CH0_Msk				(0xFF << PWM_PERIOD_CH0_Pos)
#define PWM_PERIOD_CH0					PWM_PERIOD_CH0_Msk

