pikasTech/PikaPython/bsp/w806/Include/wm_regs.h
#define PWM_PNUM_CH3_Pos				(24)
#define PWM_PNUM_CH3_Msk				(0xFF << PWM_PNUM_CH3_Pos)
#define PWM_PNUM_CH3					PWM_PNUM_CH3_Msk
#define PWM_PNUM_CH2_Pos				(16)
#define PWM_PNUM_CH2_Msk				(0xFF << PWM_PNUM_CH2_Pos)
#define PWM_PNUM_CH2					PWM_PNUM_CH2_Msk
#define PWM_PNUM_CH1_Pos				(8)
#define PWM_PNUM_CH1_Msk				(0xFF << PWM_PNUM_CH1_Pos)
#define PWM_PNUM_CH1					PWM_PNUM_CH1_Msk
#define PWM_PNUM_CH0_Pos				(0)
#define PWM_PNUM_CH0_Msk				(0xFF << PWM_PNUM_CH0_Pos)
#define PWM_PNUM_CH0					PWM_PNUM_CH0_Msk

#define PWM_CMPDAT_CH3_Pos				(24)
#define PWM_CMPDAT_CH3_Msk				(0xFF << PWM_CMPDAT_CH3_Pos)
#define PWM_CMPDAT_CH3					PWM_CMPDAT_CH3_Msk
#define PWM_CMPDAT_CH2_Pos				(16)
#define PWM_CMPDAT_CH2_Msk				(0xFF << PWM_CMPDAT_CH2_Pos)
#define PWM_CMPDAT_CH2					PWM_CMPDAT_CH2_Msk
#define PWM_CMPDAT_CH1_Pos				(8)
#define PWM_CMPDAT_CH1_Msk				(0xFF << PWM_CMPDAT_CH1_Pos)
#define PWM_CMPDAT_CH1					PWM_CMPDAT_CH1_Msk
#define PWM_CMPDAT_CH0_Pos				(0)
#define PWM_CMPDAT_CH0_Msk				(0xFF << PWM_CMPDAT_CH0_Pos)
#define PWM_CMPDAT_CH0					PWM_CMPDAT_CH0_Msk

#define PWM_DTCR_DTEN23_Pos				(21)
#define PWM_DTCR_DTEN23_Msk				(0x1 << PWM_DTCR_DTEN23_Pos)
#define PWM_DTCR_DTEN23					PWM_DTCR_DTEN23_Msk
#define PWM_DTCR_DTEN01_Pos				(20)
#define PWM_DTCR_DTEN01_Msk				(0x1 << PWM_DTCR_DTEN01_Pos)
#define PWM_DTCR_DTEN01					PWM_DTCR_DTEN01_Msk
#define PWM_DTCR_DTDIV_Pos				(16)
#define PWM_DTCR_DTDIV_Msk				(0x3 << PWM_DTCR_DTDIV_Pos)
#define PWM_DTCR_DTDIV					PWM_DTCR_DTDIV_Msk
#define PWM_DTCR_DTDIV_1				(0x00 << PWM_DTCR_DTDIV_Pos)
#define PWM_DTCR_DTDIV_2				(0x01 << PWM_DTCR_DTDIV_Pos)
#define PWM_DTCR_DTDIV_4				(0x02 << PWM_DTCR_DTDIV_Pos)
#define PWM_DTCR_DTDIV_8				(0x03 << PWM_DTCR_DTDIV_Pos)
#define PWM_DTCR_DTCNT23_Pos			(8)
#define PWM_DTCR_DTCNT23_Msk			(0xFF << PWM_DTCR_DTCNT23_Pos)
#define PWM_DTCR_DTCNT23				PWM_DTCR_DTCNT23_Msk
#define PWM_DTCR_DTCNT01_Pos			(0)
#define PWM_DTCR_DTCNT01_Msk			(0xFF << PWM_DTCR_DTCNT01_Pos)
#define PWM_DTCR_DTCNT01				PWM_DTCR_DTCNT01_Msk

#define PWM_IE_DMAEN_Pos				(7)
#define PWM_IE_DMAEN_Msk				(0x1 << PWM_IE_DMAEN_Pos)
#define PWM_IE_DMAEN					PWM_IE_DMAEN_Msk
#define PWM_IE_FLIEN_Pos				(6)
#define PWM_IE_FLIEN_Msk				(0x1 << PWM_IE_FLIEN_Pos)
#define PWM_IE_FLIEN					PWM_IE_FLIEN_Msk
#define PWM_IE_RLIEN_Pos				(5)
#define PWM_IE_RLIEN_Msk				(0x1 << PWM_IE_RLIEN_Pos)
#define PWM_IE_RLIEN					PWM_IE_RLIEN_Msk
#define PWM_IE_PIEN_Pos					(0)
#define PWM_IE_PIEN_Msk					(0x1F << PWM_IE_PIEN_Pos)
#define PWM_IE_PIEN						PWM_IE_PIEN_Msk

#define PWM_IF_OVERFL_Pos				(9)
#define PWM_IF_OVERFL_Msk				(0x1 << PWM_IF_OVERFL_Pos)
#define PWM_IF_OVERFL					PWM_IF_OVERFL_Msk
#define PWM_IF_FLIFOV_Pos				(8)
#define PWM_IF_FLIFOV_Msk				(0x1 << PWM_IF_FLIFOV_Pos)
#define PWM_IF_FLIFOV					PWM_IF_FLIFOV_Msk
#define PWM_IF_RLIFOV_Pos				(7)
#define PWM_IF_RLIFOV_Msk				(0x1 << PWM_IF_RLIFOV_Pos)
#define PWM_IF_RLIFOV					PWM_IF_RLIFOV_Msk
#define PWM_IF_CFLIF_Pos				(6)
#define PWM_IF_CFLIF_Msk				(0x1 << PWM_IF_CFLIF_Pos)
#define PWM_IF_CFLIF					PWM_IF_CFLIF_Msk
#define PWM_IF_CRLIF_Pos				(5)
#define PWM_IF_CRLIF_Msk				(0x1 << PWM_IF_CRLIF_Pos)
#define PWM_IF_CRLIF					PWM_IF_CRLIF_Msk
#define PWM_IF_PIF_Pos					(0)
#define PWM_IF_PIF_Msk					(0x1F << PWM_IF_PIF_Pos)
#define PWM_IF_PIF						PWM_IF_PIF_Msk

#define PWM_CH0CAPDAT_F_Pos				(16)
#define PWM_CH0CAPDAT_F_Msk				(0xFFFF << PWM_CH0CAPDAT_F_Pos)
#define PWM_CH0CAPDAT_F					PWM_CH0CAPDAT_F_Msk
#define PWM_CH0CAPDAT_R_Pos				(0)
#define PWM_CH0CAPDAT_R_Msk				(0xFFFF << PWM_CH0CAPDAT_R_Pos)
#define PWM_CH0CAPDAT_R					PWM_CH0CAPDAT_R_Msk

#define PWM_BKCR_EN_Pos					(11)
#define PWM_BKCR_EN_Msk					(0x1F << PWM_BKCR_EN_Pos)
#define PWM_BKCR_EN						PWM_BKCR_EN_Msk
#define PWM_BKCR_EN_CH0					(0x01 << PWM_BKCR_EN_Pos)
#define PWM_BKCR_EN_CH1					(0x02 << PWM_BKCR_EN_Pos)
#define PWM_BKCR_EN_CH2					(0x04 << PWM_BKCR_EN_Pos)
#define PWM_BKCR_EN_CH3					(0x08 << PWM_BKCR_EN_Pos)
#define PWM_BKCR_EN_CH4					(0x10 << PWM_BKCR_EN_Pos)
#define PWM_BKCR_OD_Pos					(3)
#define PWM_BKCR_OD_Msk					(0x1F << PWM_BKCR_OD_Pos)
#define PWM_BKCR_OD						PWM_BKCR_OD_Msk
#define PWM_BKCR_OD_CH0					(0x01 << PWM_BKCR_OD_Pos)
#define PWM_BKCR_OD_CH1					(0x02 << PWM_BKCR_OD_Pos)
#define PWM_BKCR_OD_CH2					(0x04 << PWM_BKCR_OD_Pos)
#define PWM_BKCR_OD_CH3					(0x08 << PWM_BKCR_OD_Pos)
#define PWM_BKCR_OD_CH4					(0x10 << PWM_BKCR_OD_Pos)

#define PWM_CH4CR1_DIV_Pos				(16)
#define PWM_CH4CR1_DIV_Msk				(0xFFFF << PWM_CH4CR1_DIV_Pos)
#define PWM_CH4CR1_DIV					PWM_CH4CR1_DIV_Msk
#define PWM_CH4CR1_PRD_Pos				(8)
#define PWM_CH4CR1_PRD_Msk				(0xFF << PWM_CH4CR1_PRD_Pos)
#define PWM_CH4CR1_PRD					PWM_CH4CR1_PRD_Msk
#define PWM_CH4CR1_PNUM_Pos				(0)
#define PWM_CH4CR1_PNUM_Msk				(0xFF << PWM_CH4CR1_PNUM_Pos)
#define PWM_CH4CR1_PNUM					PWM_CH4CR1_PNUM_Msk

#define PWM_CH4CR2_CMP_Pos				(8)
#define PWM_CH4CR2_CMP_Msk				(0xFF << PWM_CH4CR2_CMP_Pos)
#define PWM_CH4CR2_CMP					PWM_CH4CR2_CMP_Msk
#define PWM_CH4CR2_CNTTYPE_Pos			(3)
#define PWM_CH4CR2_CNTTYPE_Msk			(0x3 << PWM_CH4CR2_CNTTYPE_Pos)
#define PWM_CH4CR2_CNTTYPE				PWM_CH4CR2_CNTTYPE_Msk
#define PWM_CH4CR2_CNTMODE_Pos			(1)
#define PWM_CH4CR2_CNTMODE_Msk			(0x1 << PWM_CH4CR2_CNTMODE_Pos)
#define PWM_CH4CR2_CNTMODE				PWM_CH4CR2_CNTMODE_Msk
#define PWM_CH4CR2_PINV_Pos				(0)
#define PWM_CH4CR2_PINV_Msk				(0x1 << PWM_CH4CR2_PINV_Pos)
#define PWM_CH4CR2_PINV					PWM_CH4CR2_PINV_Msk

#define PWM_CH4CAPDAT_F_Pos				(16)
#define PWM_CH4CAPDAT_F_Msk				(0xFFFF << PWM_CH4CAPDAT_F_Pos)
#define PWM_CH4CAPDAT_F					PWM_CH4CAPDAT_F_Msk
#define PWM_CH4CAPDAT_R_Pos				(0)
#define PWM_CH4CAPDAT_R_Msk				(0xFFFF << PWM_CH4CAPDAT_R_Pos)
#define PWM_CH4CAPDAT_R					PWM_CH4CAPDAT_R_Msk

#define PWM_CH4CR3_DMAEN_Pos			(10)
#define PWM_CH4CR3_DMAEN_Msk			(0x1 << PWM_CH4CR3_DMAEN_Pos)
#define PWM_CH4CR3_DMAEN				PWM_CH4CR3_DMAEN_Msk
#define PWM_CH4CR3_FLIEN_Pos			(9)
#define PWM_CH4CR3_FLIEN_Msk			(0x1 << PWM_CH4CR3_FLIEN_Pos)
#define PWM_CH4CR3_FLIEN				PWM_CH4CR3_FLIEN_Msk
#define PWM_CH4CR3_RLIEN_Pos			(8)
#define PWM_CH4CR3_RLIEN_Msk			(0x1 << PWM_CH4CR3_RLIEN_Pos)
#define PWM_CH4CR3_RLIEN				PWM_CH4CR3_RLIEN_Msk
#define PWM_CH4CR3_OVERFL_Pos			(7)
#define PWM_CH4CR3_OVERFL_Msk			(0x1 << PWM_CH4CR3_OVERFL_Pos)
#define PWM_CH4CR3_OVERFL				PWM_CH4CR3_OVERFL_Msk
#define PWM_CH4CR3_FLIFOV_Pos			(6)
#define PWM_CH4CR3_FLIFOV_Msk			(0x1 << PWM_CH4CR3_FLIFOV_Pos)
#define PWM_CH4CR3_FLIFOV				PWM_CH4CR3_FLIFOV_Msk
#define PWM_CH4CR3_RLIFOV_Pos			(5)
#define PWM_CH4CR3_RLIFOV_Msk			(0x1 << PWM_CH4CR3_RLIFOV_Pos)
#define PWM_CH4CR3_RLIFOV				PWM_CH4CR3_RLIFOV_Msk
#define PWM_CH4CR3_CFLIF_Pos			(4)
#define PWM_CH4CR3_CFLIF_Msk			(0x1 << PWM_CH4CR3_CFLIF_Pos)
#define PWM_CH4CR3_CFLIF				PWM_CH4CR3_CFLIF_Msk
#define PWM_CH4CR3_CRLIF_Pos			(3)
#define PWM_CH4CR3_CRLIF_Msk			(0x1 << PWM_CH4CR3_CRLIF_Pos)
#define PWM_CH4CR3_CRLIF				PWM_CH4CR3_CRLIF_Msk
#define PWM_CH4CR3_POEN_Pos				(2)
#define PWM_CH4CR3_POEN_Msk				(0x1 << PWM_CH4CR3_POEN_Pos)
#define PWM_CH4CR3_POEN					PWM_CH4CR3_POEN_Msk
#define PWM_CH4CR3_CPEN_Pos				(1)
#define PWM_CH4CR3_CPEN_Msk				(0x1 << PWM_CH4CR3_CPEN_Pos)
#define PWM_CH4CR3_CPEN					PWM_CH4CR3_CPEN_Msk
#define PWM_CH4CR3_CAPINV_Pos			(0)
#define PWM_CH4CR3_CAPINV_Msk			(0x1 << PWM_CH4CR3_CAPINV_Pos)
#define PWM_CH4CR3_CAPINV				PWM_CH4CR3_CAPINV_Msk


/***************************************************************
 * Internal Flash Reg
 ***************************************************************/
 
#define FLASH_BASE				(DEVICE_BASE_ADDR + 0x2000)

typedef struct
{
	__IOM uint32_t CMD_INFO;
	__IOM uint32_t CMD_START;
	__IOM uint32_t FLASH_CR;
	__IOM uint32_t REMAP;
	__IOM uint32_t ADDR;
	__IOM uint32_t DECRYPT_CR;
	__IM uint32_t DECRYPT_STA;
} FLASH_TypeDef;

