pikasTech/PikaPython/bsp/w806/Include/wm_regs.h
#define FLASH_CMD_INFO_A_Pos			(31)
#define FLASH_CMD_INFO_A_Msk			(0x1 << FLASH_CMD_INFO_A_Pos)
#define FLASH_CMD_INFO_A				FLASH_CMD_INFO_A_Msk
#define FLASH_CMD_INFO_CRM_Pos			(30)
#define FLASH_CMD_INFO_CRM_Msk			(0x1 << FLASH_CMD_INFO_CRM_Pos)
#define FLASH_CMD_INFO_CRM				FLASH_CMD_INFO_CRM_Msk
#define FLASH_CMD_INFO_DM_Pos			(29)
#define FLASH_CMD_INFO_DM_Msk			(0x1 << FLASH_CMD_INFO_DM_Pos)
#define FLASH_CMD_INFO_DM				FLASH_CMD_INFO_DM_Msk
#define FLASH_CMD_INFO_DM_LEN_Pos		(26)
#define FLASH_CMD_INFO_DM_LEN_Msk		(0x7 << FLASH_CMD_INFO_DM_LEN_Pos)
#define FLASH_CMD_INFO_DM_LEN			FLASH_CMD_INFO_DM_LEN_Msk
#define FLASH_CMD_INFO_DATA_LEN_Pos		(16)
#define FLASH_CMD_INFO_DATA_LEN_Msk		(0x2FF << FLASH_CMD_INFO_DATA_LEN_Pos)
#define FLASH_CMD_INFO_DATA_LEN			FLASH_CMD_INFO_DATA_LEN_Msk
#define FLASH_CMD_INFO_DATA_Pos			(15)
#define FLASH_CMD_INFO_DATA_Msk			(0x1 << FLASH_CMD_INFO_DATA_Pos)
#define FLASH_CMD_INFO_DATA				FLASH_CMD_INFO_DATA_Msk
#define FLASH_CMD_INFO_RD_Pos			(14)
#define FLASH_CMD_INFO_RD_Msk			(0x1 << FLASH_CMD_INFO_RD_Pos)
#define FLASH_CMD_INFO_RD				FLASH_CMD_INFO_RD_Msk
#define FLASH_CMD_INFO_WRSR_Pos			(13)
#define FLASH_CMD_INFO_WRSR_Msk			(0x1 << FLASH_CMD_INFO_WRSR_Pos)
#define FLASH_CMD_INFO_WRSR				FLASH_CMD_INFO_WRSR_Msk
#define FLASH_CMD_INFO_PP_Pos			(12)
#define FLASH_CMD_INFO_PP_Msk			(0x1 << FLASH_CMD_INFO_PP_Pos)
#define FLASH_CMD_INFO_PP				FLASH_CMD_INFO_PP_Msk
#define FLASH_CMD_INFO_SE_Pos			(11)
#define FLASH_CMD_INFO_SE_Msk			(0x1 << FLASH_CMD_INFO_SE_Pos)
#define FLASH_CMD_INFO_SE				FLASH_CMD_INFO_SE_Msk
#define FLASH_CMD_INFO_BE_Pos			(10)
#define FLASH_CMD_INFO_BE_Msk			(0x1 << FLASH_CMD_INFO_BE_Pos)
#define FLASH_CMD_INFO_BE				FLASH_CMD_INFO_BE_Msk
#define FLASH_CMD_INFO_HBE_Pos			(9)
#define FLASH_CMD_INFO_HBE_Msk			(0x1 << FLASH_CMD_INFO_HBE_Pos)
#define FLASH_CMD_INFO_HBE				FLASH_CMD_INFO_HBE_Msk
#define FLASH_CMD_INFO_CE_Pos			(8)
#define FLASH_CMD_INFO_CE_Msk			(0x1 << FLASH_CMD_INFO_CE_Pos)
#define FLASH_CMD_INFO_CE				FLASH_CMD_INFO_CE_Msk
#define FLASH_CMD_INFO_CMD_Pos			(0)
#define FLASH_CMD_INFO_CMD_Msk			(0xFF << FLASH_CMD_INFO_CMD_Pos)
#define FLASH_CMD_INFO_CMD				FLASH_CMD_INFO_CMD_Msk

#define FLASH_CMD_START_CMD_Pos			(8)
#define FLASH_CMD_START_CMD_Msk			(0x1 << FLASH_CMD_START_CMD_Pos)
#define FLASH_CMD_START_CMD				FLASH_CMD_START_CMD_Msk
#define FLASH_CMD_START_CRM_Pos			(0)
#define FLASH_CMD_START_CRM_Msk			(0xFF << FLASH_CMD_START_CRM_Pos)
#define FLASH_CMD_START_CRM				FLASH_CMD_START_CRM_Msk

#define FLASH_FLASH_CR_ADMOD_Pos		(4)
#define FLASH_FLASH_CR_ADMOD_Msk		(0x3 << FLASH_FLASH_CR_ADMOD_Pos)
#define FLASH_FLASH_CR_ADMOD			FLASH_FLASH_CR_ADMOD_Msk
#define FLASH_FLASH_CR_TSHSL_Pos		(2)
#define FLASH_FLASH_CR_TSHSL_Msk		(0x3 << FLASH_FLASH_CR_TSHSL_Pos)
#define FLASH_FLASH_CR_TSHSL			FLASH_FLASH_CR_TSHSL_Msk
#define FLASH_FLASH_CR_QPIM_Pos			(1)
#define FLASH_FLASH_CR_QPIM_Msk			(0x1 << FLASH_FLASH_CR_QPIM_Pos)
#define FLASH_FLASH_CR_QPIM				FLASH_FLASH_CR_QPIM_Msk
#define FLASH_FLASH_CR_QIOM_Pos			(0)
#define FLASH_FLASH_CR_QIOM_Msk			(0x1 << FLASH_FLASH_CR_QIOM_Pos)
#define FLASH_FLASH_CR_QIOM				FLASH_FLASH_CR_QIOM_Msk

#define FLASH_REMAP_Pos					(0)
#define FLASH_REMAP_Msk					(0x1 << FLASH_REMAP_Pos)
#define FLASH_REMAP						FLASH_REMAP_Msk

#define FLASH_ADDR_Pos					(0)
#define FLASH_ADDR_Msk					(0xFFFFFFFF << FLASH_ADDR_Pos)
#define FLASH_ADDR						FLASH_ADDR_Msk

#define FLASH_DECRYPT_CR_START_Pos		(7)
#define FLASH_DECRYPT_CR_START_Msk		(0x1 << FLASH_DECRYPT_CR_START_Pos)
#define FLASH_DECRYPT_CR_START			FLASH_DECRYPT_CR_START_Msk
#define FLASH_DECRYPT_CR_EXPTSEL_Pos	(4)
#define FLASH_DECRYPT_CR_EXPTSEL_Msk	(0x7 << FLASH_DECRYPT_CR_EXPTSEL_Pos)
#define FLASH_DECRYPT_CR_EXPTSEL		FLASH_DECRYPT_CR_EXPTSEL_Msk
#define FLASH_DECRYPT_CR_DATADECRYPT_Pos		(3)
#define FLASH_DECRYPT_CR_DATADECRYPT_Msk		(0x1 << FLASH_DECRYPT_CR_DATADECRYPT_Pos)
#define FLASH_DECRYPT_CR_DATADECRYPT			FLASH_DECRYPT_CR_DATADECRYPT_Msk
#define FLASH_DECRYPT_CR_DBUSDECRYPT_Pos		(2)
#define FLASH_DECRYPT_CR_DBUSDECRYPT_Msk		(0x1 << FLASH_DECRYPT_CR_DBUSDECRYPT_Pos)
#define FLASH_DECRYPT_CR_DBUSDECRYPT			FLASH_DECRYPT_CR_DBUSDECRYPT_Msk
#define FLASH_DECRYPT_CR_CODEDECRYPT_Pos		(1)
#define FLASH_DECRYPT_CR_CODEDECRYPT_Msk		(0x1 << FLASH_DECRYPT_CR_CODEDECRYPT_Pos)
#define FLASH_DECRYPT_CR_CODEDECRYPT			FLASH_DECRYPT_CR_CODEDECRYPT_Msk

#define FLASH_DECRYPT_STA_KEYERR_Pos		(2)
#define FLASH_DECRYPT_STA_KEYERR_Msk		(0x1 << FLASH_DECRYPT_STA_KEYERR_Pos)
#define FLASH_DECRYPT_STA_KEYERR			FLASH_DECRYPT_STA_KEYERR_Msk
#define FLASH_DECRYPT_STA_KEYRDY_Pos		(1)
#define FLASH_DECRYPT_STA_KEYRDY_Msk		(0x1 << FLASH_DECRYPT_STA_KEYRDY_Pos)
#define FLASH_DECRYPT_STA_KEYRDY			FLASH_DECRYPT_STA_KEYRDY_Msk
#define FLASH_DECRYPT_STA_RSA_Pos			(0)
#define FLASH_DECRYPT_STA_RSA_Msk			(0x1 << FLASH_DECRYPT_STA_RSA_Pos)
#define FLASH_DECRYPT_STA_RSA				FLASH_DECRYPT_STA_RSA_Msk


/***************************************************************
 * RSA Reg
 ***************************************************************/
 
#define RSA_BASE       0x40000000

typedef struct
{
	__IOM uint32_t XBUF[256];
	__IOM uint32_t YBUF[256];
	__IOM uint32_t MBUF[256];
	__IOM uint32_t DBUF[256];
	__IOM uint32_t RSACON;
	__IOM uint32_t RSAMC;
	__IOM uint32_t RSAN;
} RSA_TypeDef;
 

/***************************************************************
 * ADC Reg
 ***************************************************************/
 
#define ADC_BASE	(HR_APB_BASE_ADDR + 0x0200)

typedef struct
{
	__IM uint32_t DR;
	__IOM uint32_t ANA_CR;
	__IOM uint32_t PGA_CR;
	__IOM uint32_t TEMP_CR;
	__IOM uint32_t ADC_CR;
	__IOM uint32_t IF;
	__IOM uint32_t CMP_VAL;
} ADC_TypeDef;

#define ADC_ANA_CR_CH_Pos				(8)
#define ADC_ANA_CR_CH_Msk				(0xFUL << ADC_ANA_CR_CH_Pos)
#define ADC_ANA_CR_CH					ADC_ANA_CR_CH_Msk
#define ADC_ANA_CR_CH_0					(0x0UL << ADC_ANA_CR_CH_Pos)
#define ADC_ANA_CR_CH_1					(0x1UL << ADC_ANA_CR_CH_Pos)
#define ADC_ANA_CR_CH_2					(0x2UL << ADC_ANA_CR_CH_Pos)
#define ADC_ANA_CR_CH_3					(0x3UL << ADC_ANA_CR_CH_Pos)
#define ADC_ANA_CR_CH_8					(0x8UL << ADC_ANA_CR_CH_Pos)
#define ADC_ANA_CR_CH_9					(0x9UL << ADC_ANA_CR_CH_Pos)
#define ADC_ANA_CR_CH_TEMP				(0xCUL << ADC_ANA_CR_CH_Pos)
#define ADC_ANA_CR_CH_VOL				(0xDUL << ADC_ANA_CR_CH_Pos)
#define ADC_ANA_CR_CH_OFFSET			(0xEUL << ADC_ANA_CR_CH_Pos)
#define ADC_ANA_CR_CHOPENR_Pos			(5)
#define ADC_ANA_CR_CHOPENR_Msk			(0x3UL << ADC_ANA_CR_CHOPENR_Pos)
#define ADC_ANA_CR_CHOPENR				ADC_ANA_CR_CHOPENR_Msk
#define ADC_ANA_CR_CHOPENS_Pos			(4)
#define ADC_ANA_CR_CHOPENS_Msk			(0x1UL << ADC_ANA_CR_CHOPENS_Pos)
#define ADC_ANA_CR_CHOPENS				ADC_ANA_CR_CHOPENS_Msk
#define ADC_ANA_CR_PD_Pos				(2)
#define ADC_ANA_CR_PD_Msk				(0x1UL << ADC_ANA_CR_PD_Pos)
#define ADC_ANA_CR_PD					ADC_ANA_CR_PD_Msk
#define ADC_ANA_CR_RST_Pos				(1)
#define ADC_ANA_CR_RST_Msk				(0x1UL << ADC_ANA_CR_RST_Pos)
#define ADC_ANA_CR_RST					ADC_ANA_CR_RST_Msk
#define ADC_ANA_CR_LDOEN_Pos			(0)
#define ADC_ANA_CR_LDOEN_Msk			(0x1UL << ADC_ANA_CR_LDOEN_Pos)
#define ADC_ANA_CR_LDOEN				ADC_ANA_CR_LDOEN_Msk

#define ADC_PGA_CR_GAIN_Pos				(4)
#define ADC_PGA_CR_GAIN_Msk				(0x1FUL << ADC_PGA_CR_GAIN_Pos)
#define ADC_PGA_CR_GAIN					ADC_PGA_CR_GAIN_Msk
#define ADC_PGA_CR_BP_Pos				(3)
#define ADC_PGA_CR_BP_Msk				(0x1UL << ADC_PGA_CR_BP_Pos)
#define ADC_PGA_CR_BP					ADC_PGA_CR_BP_Msk
#define ADC_PGA_CR_BPREF_Pos			(2)
#define ADC_PGA_CR_BPREF_Msk			(0x1UL << ADC_PGA_CR_BPREF_Pos)
#define ADC_PGA_CR_BPREF				ADC_PGA_CR_BPREF_Msk
#define ADC_PGA_CR_CHOPEN_Pos			(1)
#define ADC_PGA_CR_CHOPEN_Msk			(0x1UL << ADC_PGA_CR_CHOPEN_Pos)
#define ADC_PGA_CR_CHOPEN				ADC_PGA_CR_CHOPEN_Msk
#define ADC_PGA_CR_PGAEN_Pos			(0)
#define ADC_PGA_CR_PGAEN_Msk			(0x1UL << ADC_PGA_CR_PGAEN_Pos)
#define ADC_PGA_CR_PGAEN				ADC_PGA_CR_PGAEN_Msk

#define ADC_TEMP_CR_GAIN_Pos			(4)
#define ADC_TEMP_CR_GAIN_Msk			(0x3UL << ADC_TEMP_CR_GAIN_Pos)
#define ADC_TEMP_CR_GAIN				ADC_TEMP_CR_GAIN_Msk
#define ADC_TEMP_CR_OFFSET_Pos			(1)
#define ADC_TEMP_CR_OFFSET_Msk			(0x1UL << ADC_TEMP_CR_OFFSET_Pos)
#define ADC_TEMP_CR_OFFSET				ADC_TEMP_CR_OFFSET_Msk
#define ADC_TEMP_CR_EN_Pos				(0)
#define ADC_TEMP_CR_EN_Msk				(0x1UL << ADC_TEMP_CR_EN_Pos)
#define ADC_TEMP_CR_EN					ADC_TEMP_CR_EN_Msk

#define ADC_ADC_CR_SWITCHTIME_Pos		(20)
#define ADC_ADC_CR_SWITCHTIME_Msk		(0x3FFUL << ADC_ADC_CR_SWITCHTIME_Pos)
#define ADC_ADC_CR_SWITCHTIME			ADC_ADC_CR_SWITCHTIME_Msk
#define ADC_ADC_CR_INITTIME_Pos			(8)
#define ADC_ADC_CR_INITTIME_Msk			(0x3FFUL << ADC_ADC_CR_INITTIME_Pos)
#define ADC_ADC_CR_INITTIME				ADC_ADC_CR_INITTIME_Msk
#define ADC_ADC_CR_CMPPOL_Pos			(6)
#define ADC_ADC_CR_CMPPOL_Msk			(0x1UL << ADC_ADC_CR_CMPPOL_Pos)
#define ADC_ADC_CR_CMPPOL				ADC_ADC_CR_CMPPOL_Msk
#define ADC_ADC_CR_CMPIE_Pos			(5)
#define ADC_ADC_CR_CMPIE_Msk			(0x1UL << ADC_ADC_CR_CMPIE_Pos)
#define ADC_ADC_CR_CMPIE				ADC_ADC_CR_CMPIE_Msk
#define ADC_ADC_CR_CMPEN_Pos			(4)
#define ADC_ADC_CR_CMPEN_Msk			(0x1UL << ADC_ADC_CR_CMPEN_Pos)
#define ADC_ADC_CR_CMPEN				ADC_ADC_CR_CMPEN_Msk
#define ADC_ADC_CR_ADCIE_Pos			(1)
#define ADC_ADC_CR_ADCIE_Msk			(0x1UL << ADC_ADC_CR_ADCIE_Pos)
#define ADC_ADC_CR_ADCIE				ADC_ADC_CR_ADCIE_Msk
#define ADC_ADC_CR_DMAEN_Pos			(0)
#define ADC_ADC_CR_DMAEN_Msk			(0x1UL << ADC_ADC_CR_DMAEN_Pos)
#define ADC_ADC_CR_DMAEN				ADC_ADC_CR_DMAEN_Msk

#define ADC_IF_CMP_Pos					(1)
#define ADC_IF_CMP_Msk					(0x1UL << ADC_IF_CMP_Pos)
#define ADC_IF_CMP						ADC_IF_CMP_Msk
#define ADC_IF_ADC_Pos					(0)
#define ADC_IF_ADC_Msk					(0x1UL << ADC_IF_ADC_Pos)
#define ADC_IF_ADC						ADC_IF_ADC_Msk


/***************************************************************
 * GPIO Reg
 ***************************************************************/
#define GPIOA_BASE            (HR_APB_BASE_ADDR + 0x1200)
#define GPIOB_BASE            (HR_APB_BASE_ADDR + 0x1400)

typedef struct
{
	__IOM uint32_t DATA;
	__IOM uint32_t DATA_B_EN;
	__IOM uint32_t DIR;
	__IOM uint32_t PULLUP_EN;
	__IOM uint32_t AF_SEL;
	__IOM uint32_t AF_S1;
	__IOM uint32_t AF_S0;
	__IOM uint32_t PULLDOWN_EN;
	__IOM uint32_t IS;
	__IOM uint32_t IBE;
	__IOM uint32_t IEV;
	__IOM uint32_t IE;
	__IM uint32_t RIS;
	__IM uint32_t MIS;
	__OM uint32_t IC;
} GPIO_TypeDef;


/***************************************************************
 * I2S Reg
 ***************************************************************/

#define I2S_BASE            (HR_APB_BASE_ADDR + 0x2000)

typedef struct
{
	__IOM uint32_t CR;
	__IOM uint32_t IM;
	__IOM uint32_t IF;
	__IM uint32_t SR;
	__OM uint32_t TXDR;
	__IM uint32_t RXDR;
}I2S_TypeDef;

#define I2S_CR_MODE_Pos				(28)
#define I2S_CR_MODE_Msk				(0x1UL << I2S_CR_MODE_Pos)
#define I2S_CR_MODE					I2S_CR_MODE_Msk
#define I2S_CR_DUPLEX_Pos			(27)
#define I2S_CR_DUPLEX_Msk			(0x1UL << I2S_CR_DUPLEX_Pos)
#define I2S_CR_DUPLEX				I2S_CR_DUPLEX_Msk
#define I2S_CR_RXTIMEOUT_Pos		(26)
#define I2S_CR_RXTIMEOUT_Msk		(0x1UL << I2S_CR_RXTIMEOUT_Pos)
#define I2S_CR_RXTIMEOUT			I2S_CR_RXTIMEOUT_Msk
#define I2S_CR_FORMAT_Pos			(24)
#define I2S_CR_FORMAT_Msk			(0x3UL << I2S_CR_FORMAT_Pos)
#define I2S_CR_FORMAT				I2S_CR_FORMAT_Msk
#define I2S_CR_FORMAT_I2S			(0x0UL << I2S_CR_FORMAT_Pos)
#define I2S_CR_FORMAT_MSBJUSTIFIED	(0x1UL << I2S_CR_FORMAT_Pos)
#define I2S_CR_FORMAT_PCMA			(0x2UL << I2S_CR_FORMAT_Pos)
#define I2S_CR_FORMAT_PCMB			(0x3UL << I2S_CR_FORMAT_Pos)
#define I2S_CR_RXLRCH_Pos			(23)
#define I2S_CR_RXLRCH_Msk			(0x1UL << I2S_CR_RXLRCH_Pos)
#define I2S_CR_RXLRCH				I2S_CR_RXLRCH_Msk
#define I2S_CR_MONO_STEREO_Pos		(22)
#define I2S_CR_MONO_STEREO_Msk		(0x1UL << I2S_CR_MONO_STEREO_Pos)
#define I2S_CR_MONO_STEREO			I2S_CR_MONO_STEREO_Msk
#define I2S_CR_RXDMA_EN_Pos			(21)
#define I2S_CR_RXDMA_EN_Msk			(0x1UL << I2S_CR_RXDMA_EN_Pos)
#define I2S_CR_RXDMA_EN				I2S_CR_RXDMA_EN_Msk
#define I2S_CR_TXDMA_EN_Pos			(20)
#define I2S_CR_TXDMA_EN_Msk			(0x1UL << I2S_CR_TXDMA_EN_Pos)
#define I2S_CR_TXDMA_EN				I2S_CR_TXDMA_EN_Msk
#define I2S_CR_RXFIFO_CLR_Pos		(19)
#define I2S_CR_RXFIFO_CLR_Msk		(0x1UL << I2S_CR_RXFIFO_CLR_Pos)
#define I2S_CR_RXFIFO_CLR			I2S_CR_RXFIFO_CLR_Msk
#define I2S_CR_TXFIFO_CLR_Pos		(18)
#define I2S_CR_TXFIFO_CLR_Msk		(0x1UL << I2S_CR_TXFIFO_CLR_Pos)
#define I2S_CR_TXFIFO_CLR			I2S_CR_TXFIFO_CLR_Msk
#define I2S_CR_LZCEN_Pos			(17)
#define I2S_CR_LZCEN_Msk			(0x1UL << I2S_CR_LZCEN_Pos)
#define I2S_CR_LZCEN				I2S_CR_LZCEN_Msk
#define I2S_CR_RZCEN_Pos			(16)
#define I2S_CR_RZCEN_Msk			(0x1UL << I2S_CR_RZCEN_Pos)
#define I2S_CR_RZCEN				I2S_CR_RZCEN_Msk
#define I2S_CR_RXCLK_INVERSE_Pos	(15)
#define I2S_CR_RXCLK_INVERSE_Msk	(0x1UL << I2S_CR_RXCLK_INVERSE_Pos)
#define I2S_CR_RXCLK_INVERSE		(I2S_CR_RXCLK_INVERSE_Msk)
#define I2S_CR_RXFIFO_TH_Pos		(12)
#define I2S_CR_RXFIFO_TH_Msk		(0x7UL << I2S_CR_RXFIFO_TH_Pos)
#define I2S_CR_RXFIFO_TH			I2S_CR_RXFIFO_TH_Msk
#define I2S_CR_RXFIFO_TH_0			(0x0UL << I2S_CR_RXFIFO_TH_Pos)
#define I2S_CR_RXFIFO_TH_1			(0x1UL << I2S_CR_RXFIFO_TH_Pos)
#define I2S_CR_RXFIFO_TH_2			(0x2UL << I2S_CR_RXFIFO_TH_Pos)
#define I2S_CR_RXFIFO_TH_3			(0x3UL << I2S_CR_RXFIFO_TH_Pos)
#define I2S_CR_RXFIFO_TH_4			(0x4UL << I2S_CR_RXFIFO_TH_Pos)
#define I2S_CR_RXFIFO_TH_5			(0x5UL << I2S_CR_RXFIFO_TH_Pos)
#define I2S_CR_RXFIFO_TH_6			(0x6UL << I2S_CR_RXFIFO_TH_Pos)
#define I2S_CR_RXFIFO_TH_7			(0x7UL << I2S_CR_RXFIFO_TH_Pos)
#define I2S_CR_TXFIFO_TH_Pos		(9)
#define I2S_CR_TXFIFO_TH_Msk		(0x7UL << I2S_CR_TXFIFO_TH_Pos)
#define I2S_CR_TXFIFO_TH			I2S_CR_TXFIFO_TH_Msk
#define I2S_CR_TXFIFO_TH_0			(0x0UL << I2S_CR_TXFIFO_TH_Pos)
#define I2S_CR_TXFIFO_TH_1			(0x1UL << I2S_CR_TXFIFO_TH_Pos)
#define I2S_CR_TXFIFO_TH_2			(0x2UL << I2S_CR_TXFIFO_TH_Pos)
#define I2S_CR_TXFIFO_TH_3			(0x3UL << I2S_CR_TXFIFO_TH_Pos)
#define I2S_CR_TXFIFO_TH_4			(0x4UL << I2S_CR_TXFIFO_TH_Pos)
#define I2S_CR_TXFIFO_TH_5			(0x5UL << I2S_CR_TXFIFO_TH_Pos)
#define I2S_CR_TXFIFO_TH_6			(0x6UL << I2S_CR_TXFIFO_TH_Pos)
#define I2S_CR_TXFIFO_TH_7			(0x7UL << I2S_CR_TXFIFO_TH_Pos)
#define I2S_CR_TXCLK_INVERSE_Pos	(8)
#define I2S_CR_TXCLK_INVERSE_Msk	(0x1UL << I2S_CR_TXCLK_INVERSE_Pos)
#define I2S_CR_TXCLK_INVERSE		I2S_CR_TXCLK_INVERSE_Msk
#define I2S_CR_DATALEN_Pos			(4)
#define I2S_CR_DATALEN_Msk			(0x3UL << I2S_CR_DATALEN_Pos)
#define I2S_CR_DATALEN				I2S_CR_DATALEN_Msk
#define I2S_CR_DATALEN_8BIT			(0x0UL << I2S_CR_DATALEN_Pos)
#define I2S_CR_DATALEN_16BIT		(0x1UL << I2S_CR_DATALEN_Pos)
#define I2S_CR_DATALEN_24BIT		(0x2UL << I2S_CR_DATALEN_Pos)
#define I2S_CR_DATALEN_32BIT		(0x3UL << I2S_CR_DATALEN_Pos)
#define I2S_CR_MUTE_Pos				(3)
#define I2S_CR_MUTE_Msk				(0x1UL << I2S_CR_MUTE_Pos)
#define I2S_CR_MUTE					I2S_CR_MUTE_Msk
#define I2S_CR_RXEN_Pos				(2)
#define I2S_CR_RXEN_Msk				(0x1UL << I2S_CR_RXEN_Pos)
#define I2S_CR_RXEN					(I2S_CR_RXEN_Msk)
#define I2S_CR_TXEN_Pos				(1)
#define I2S_CR_TXEN_Msk				(0x1UL << I2S_CR_TXEN_Pos)
#define I2S_CR_TXEN					I2S_CR_TXEN_Msk
#define I2S_CR_EN_Pos				(0)
#define I2S_CR_EN_Msk				(0x1UL << I2S_CR_EN_Pos)
#define I2S_CR_EN					I2S_CR_EN_Msk

