pikasTech/PikaPython/bsp/w806/Include/wm_regs.h
#define I2S_IM_LZCI_Pos				(9)
#define I2S_IM_LZCI_Msk				(0x1UL << I2S_IM_LZCI_Pos)
#define I2S_IM_LZCI					I2S_IM_LZCI_Msk
#define I2S_IM_RZCI_Pos				(8)
#define I2S_IM_RZCI_Msk				(0x1UL << I2S_IM_RZCI_Pos)
#define I2S_IM_RZCI					I2S_IM_RZCI_Msk
#define I2S_IM_TXDONE_Pos			(7)
#define I2S_IM_TXDONE_Msk			(0x1UL << I2S_IM_TXDONE_Pos)
#define I2S_IM_TXDONE				I2S_IM_TXDONE_Msk
#define I2S_IM_TXTH_Pos				(6)
#define I2S_IM_TXTH_Msk				(0x1UL << I2S_IM_TXTH_Pos)
#define I2S_IM_TXTH					I2S_IM_TXTH_Msk
#define I2S_IM_TX_OVERFLOW_Pos		(5)
#define I2S_IM_TX_OVERFLOW_Msk		(0x1UL << I2S_IM_TX_OVERFLOW_Pos)
#define I2S_IM_TX_OVERFLOW			I2S_IM_TX_OVERFLOW_Msk
#define I2S_IM_TX_UNDERFLOW_Pos		(4)
#define I2S_IM_TX_UNDERFLOW_Msk		(0x1UL << I2S_IM_TX_UNDERFLOW_Pos)
#define I2S_IM_TX_UNDERFLOW			I2S_IM_TX_UNDERFLOW_Msk
#define I2S_IM_RXDONE_Pos			(3)
#define I2S_IM_RXDONE_Msk			(0x1UL << I2S_IM_RXDONE_Pos)
#define I2S_IM_RXDONE				I2S_IM_RXDONE_Msk
#define I2S_IM_RXTH_Pos				(2)
#define I2S_IM_RXTH_Msk				(0x1UL << I2S_IM_RXTH_Pos)
#define I2S_IM_RXTH					I2S_IM_RXTH_Msk
#define I2S_IM_RX_OVERFLOW_Pos		(1)
#define I2S_IM_RX_OVERFLOW_Msk		(0x1UL << I2S_IM_RX_OVERFLOW_Pos)
#define I2S_IM_RX_OVERFLOW			I2S_IM_RX_OVERFLOW_Msk
#define I2S_IM_RX_UNDERFLOW_Pos		(0)
#define I2S_IM_RX_UNDERFLOW_Msk		(0x1UL << I2S_IM_RX_UNDERFLOW_Pos)
#define I2S_IM_RX_UNDERFLOW			I2S_IM_RX_UNDERFLOW_Msk

#define I2S_IF_TX_Pos				(12)
#define I2S_IF_TX_Msk				(0x1UL << I2S_IF_TX_Pos)
#define I2S_IF_TX					I2S_IF_TX_Msk
#define I2S_IF_RX_Pos				(11)
#define I2S_IF_RX_Msk				(0x1UL << I2S_IF_RX_Pos)
#define I2S_IF_RX					I2S_IF_RX_Msk
#define I2S_IF_I2S_Pos				(10)
#define I2S_IF_I2S_Msk				(0x1UL << I2S_IF_I2S_Pos)
#define I2S_IF_I2S					I2S_IF_I2S_Msk
#define I2S_IF_LZCI_Pos				(9)
#define I2S_IF_LZCI_Msk				(0x1UL << I2S_IF_LZCI_Pos)
#define I2S_IF_LZCI					I2S_IF_LZCI_Msk
#define I2S_IF_RZCI_Pos				(8)
#define I2S_IF_RZCI_Msk				(0x1UL << I2S_IF_RZCI_Pos)
#define I2S_IF_RZCI					I2S_IF_RZCI_Msk
#define I2S_IF_TXDONE_Pos			(7)
#define I2S_IF_TXDONE_Msk			(0x1UL << I2S_IF_TXDONE_Pos)
#define I2S_IF_TXDONE				I2S_IF_TXDONE_Msk
#define I2S_IF_TXTH_Pos				(6)
#define I2S_IF_TXTH_Msk				(0x1UL << I2S_IF_TXTH_Pos)
#define I2S_IF_TXTH					I2S_IF_TXTH_Msk
#define I2S_IF_TX_OVERFLOW_Pos		(5)
#define I2S_IF_TX_OVERFLOW_Msk		(0x1UL << I2S_IF_TX_OVERFLOW_Pos)
#define I2S_IF_TX_OVERFLOW			I2S_IF_TX_OVERFLOW_Msk
#define I2S_IF_TX_UNDERFLOW_Pos		(4)
#define I2S_IF_TX_UNDERFLOW_Msk		(0x1UL << I2S_IF_TX_UNDERFLOW_Pos)
#define I2S_IF_TX_UNDERFLOW			I2S_IF_TX_UNDERFLOW_Msk
#define I2S_IF_RXDONE_Pos			(3)
#define I2S_IF_RXDONE_Msk			(0x1UL << I2S_IF_RXDONE_Pos)
#define I2S_IF_RXDONE				I2S_IF_RXDONE_Msk
#define I2S_IF_RXTH_Pos				(2)
#define I2S_IF_RXTH_Msk				(0x1UL << I2S_IF_RXTH_Pos)
#define I2S_IF_RXTH					I2S_IF_RXTH_Msk
#define I2S_IF_RX_OVERFLOW_Pos		(1)
#define I2S_IF_RX_OVERFLOW_Msk		(0x1UL << I2S_IF_RX_OVERFLOW_Pos)
#define I2S_IF_RX_OVERFLOW			I2S_IF_RX_OVERFLOW_Msk
#define I2S_IF_RX_UNDERFLOW_Pos		(0)
#define I2S_IF_RX_UNDERFLOW_Msk		(0x1UL << I2S_IF_RX_UNDERFLOW_Pos)
#define I2S_IF_RX_UNDERFLOW			I2S_IF_RX_UNDERFLOW_Msk

#define I2S_SR_VALIDBYTE_Pos		(8)
#define I2S_SR_VALIDBYTE_Msk		(0x3UL << I2S_SR_VALIDBYTE_Pos)
#define I2S_SR_VALIDBYTE			I2S_SR_VALIDBYTE_Msk
#define I2S_SR_TXCNT_Pos			(4)
#define I2S_SR_TXCNT_Msk			(0xFUL << I2S_SR_TXCNT_Pos)
#define I2S_SR_TXCNT				I2S_SR_TXCNT_Msk
#define I2S_SR_RXCNT_Pos			(0)
#define I2S_SR_RXCNT_Msk			(0xFUL << I2S_SR_RXCNT_Pos)
#define I2S_SR_RXCNT				I2S_SR_RXCNT_Msk


/***************************************************************
 * TOUCH Reg
 ***************************************************************/
#define TOUCH_BASE            (HR_APB_BASE_ADDR + 0x2400)

typedef struct
{
	__IOM uint32_t CR;
	__IOM uint32_t CH0CR;
	__IOM uint32_t CH1CR;
	__IOM uint32_t CH2CR;
	__IOM uint32_t CH3CR;
	__IOM uint32_t CH4CR;
	__IOM uint32_t CH5CR;
	__IOM uint32_t CH6CR;
	__IOM uint32_t CH7CR;
	__IOM uint32_t CH8CR;
	__IOM uint32_t CH9CR;
	__IOM uint32_t CH10CR;
	__IOM uint32_t CH11CR;
	__IOM uint32_t CH12CR;
	__IOM uint32_t CH13CR;
	__IOM uint32_t CH14CR;
	__IOM uint32_t CH15CR;
	__IOM uint32_t IE_IF;
} TOUCH_TypeDef;

#define TOUCH_CR_SCAN_PERIOD_Pos	(26)
#define TOUCH_CR_SCAN_PERIOD_Msk	(0x03F << TOUCH_CR_SCAN_PERIOD_Pos)
#define TOUCH_CR_SCAN_PERIOD		TOUCH_CR_SCAN_PERIOD_Msk
#define TOUCH_CR_CAPDET_CNT_Pos		(20)
#define TOUCH_CR_CAPDET_CNT_Msk		(0x03F << TOUCH_CR_CAPDET_CNT_Pos)
#define TOUCH_CR_CAPDET_CNT			TOUCH_CR_CAPDET_CNT_Msk
#define TOUCH_CR_CH_SEL_Pos			(4)
#define TOUCH_CR_CH_SEL_Msk			(0x0FFFF << TOUCH_CR_CH_SEL_Pos)
#define TOUCH_CR_CH_SEL				TOUCH_CR_CH_SEL_Msk
#define TOUCH_CR_CH_SEL_NONE		(0 << TOUCH_CR_CH_SEL_Pos)
#define TOUCH_CR_CH_SEL_ALL			(0x0FFFF << TOUCH_CR_CH_SEL_Pos)
#define TOUCH_CR_EN_Pos				(0)
#define TOUCH_CR_EN_Msk				(0x01 << TOUCH_CR_EN_Pos)
#define TOUCH_CR_EN					TOUCH_CR_EN_Msk

#define TOUCH_CH0CR_COUNT_Pos		(8)
#define TOUCH_CH0CR_COUNT_Msk		(0x07FFF << TOUCH_CH0CR_COUNT_Pos)
#define TOUCH_CH0CR_COUNT			TOUCH_CH0CR_COUNT_Msk
#define TOUCH_CH0CR_THRESHOLD_Pos	(0)
#define TOUCH_CH0CR_THRESHOLD_Msk	(0x07F << TOUCH_CH0CR_THRESHOLD_Pos)
#define TOUCH_CH0CR_THRESHOLD		TOUCH_CH0CR_THRESHOLD_Msk

#define TOUCH_IE_IF_EN_Pos			(16)
#define TOUCH_IE_IF_EN_Msk			(0x0FFFF << TOUCH_IE_IF_EN_Pos)
#define TOUCH_IE_IF_EN				TOUCH_IE_IF_EN_Msk
#define TOUCH_IE_IF_FLAG_Pos		(0)
#define TOUCH_IE_IF_FLAG_Msk		(0x0FFFF << TOUCH_IE_IF_FLAG_Pos)
#define TOUCH_IE_IF_FLAG			TOUCH_IE_IF_FLAG_Msk


#define SET_BIT(REG, BIT)		((REG) |= (BIT))
#define CLEAR_BIT(REG, BIT)		((REG) &= ~(BIT))
#define READ_BIT(REG, BIT)		((REG) & (BIT))
#define CLEAR_REG(REG)			((REG) = (0x0))
#define WRITE_REG(REG, VAL)   	((REG) = (VAL))
#define READ_REG(REG)         	((REG)) 
#define MODIFY_REG(REG, CLEARMASK, SETMASK)  WRITE_REG((REG), (((READ_REG(REG)) & (~(CLEARMASK))) | (SETMASK)))


#endif /* WM_REGS_H */

